{
  "BrCc1cc(Br)cc(Br)c1": 1,
  "Brc1[nH]nc2c(Br)cncc12": 2,
  "Brc1c2c(c(Br)c3nsnc13)N=S=N2": 3,
  "Brc1c2ccccc2c(-c2c3ccccc3c(Br)c3ccccc23)c2ccccc12": 4,
  "Brc1c2ccccc2c(Br)c2ccccc12": 5,
  "Brc1c2ccccc2c(Br)c2nsnc12": 6,
  "Brc1c[nH]c2ccnc(Br)c12": 7,
  "Brc1cc(Br)c2[nH]ccc2c1": 8,
  "Brc1cc(Br)c2[nH]ncc2c1": 9,
  "Brc1cc(Br)c2c(c1)CCCN2": 10,
  "Brc1cc(Br)c2c(c1)CCO2": 11,
  "Brc1cc(Br)c2c(n1)CCCN2": 12,
  "Brc1cc(Br)c2cc[nH]c2c1": 13,
  "Brc1cc(Br)c2cccnc2c1": 14,
  "Brc1cc(Br)c2ccncc2n1": 15,
  "Brc1cc(Br)c2cn[nH]c2c1": 16,
  "Brc1cc(Br)c2nccn2c1": 17,
  "Brc1cc(Br)c2nccn2n1": 18,
  "Brc1cc(Br)c2ncnn2c1": 19,
  "Brc1cc(Br)cc(-c2ccccc2)c1": 20,
  "Brc1cc(Br)cc(N2CCCC2)c1": 21,
  "Brc1cc(Br)cc(N2CCCCC2)c1": 22,
  "Brc1cc(Br)cc(N2CCOCC2)c1": 23,
  "Brc1cc(Br)cc(Oc2ccccc2)c1": 24,
  "Brc1cc(Br)n2cncc2c1": 25,
  "Brc1cc(Br)ncn1": 26,
  "Brc1cc(I)c(Br)cc1I": 27,
  "Brc1cc2[nH]cc(Br)c2cn1": 28,
  "Brc1cc2c(Br)[nH]nc2cn1": 29,
  "Brc1cc2cc3sc(Br)cc3cc2s1": 30,
  "Brc1cc2ccc3cc(Br)cc4ccc(c1)c2c34": 31,
  "Brc1cc2ccccc2c(Br)n1": 32,
  "Brc1cc2cccnc2nc1Br": 33,
  "Brc1cc2n[nH]c(Br)c2cn1": 34,
  "Brc1cc2sc(Br)cc2s1": 35,
  "Brc1cc2sc3cc(Br)sc3c2s1": 36,
  "Brc1ccc(-c2ccc(-c3ccc(Br)cc3)cc2)cc1": 37,
  "Brc1ccc(-c2ccc(-c3ccc(Br)s3)s2)s1": 38,
  "Brc1ccc(-c2ccc(Br)cc2)cc1": 39,
  "Brc1ccc(-c2ccc(Br)cn2)nc1": 40,
  "Brc1ccc(-c2ccc(Br)s2)s1": 41,
  "Brc1ccc(-c2ccccc2)c(Br)c1": 42,
  "Brc1ccc(Br)[nH]1": 43,
  "Brc1ccc(Br)c2[nH]ccc12": 44,
  "Brc1ccc(Br)c2[nH]ncc12": 45,
  "Brc1ccc(Br)c2ccccc12": 46,
  "Brc1ccc(Br)c2cnccc12": 47,
  "Brc1ccc(Br)c2ncccc12": 48,
  "Brc1ccc(Br)c2nccnc12": 49,
  "Brc1ccc(Br)c2nonc12": 50,
  "Brc1ccc(Br)c2nsnc12": 51,
  "Brc1ccc(Br)c2sc(-c3ccccc3)nc12": 52,
  "Brc1ccc(Br)cc1": 53,
  "Brc1ccc(Br)nc1": 54,
  "Brc1ccc(Br)nn1": 55,
  "Brc1ccc(Br)o1": 56,
  "Brc1ccc(Br)s1": 57,
  "Brc1ccc(N(c2ccccc2)c2ccc(Br)cc2)cc1": 58,
  "Brc1ccc(OCC2CCCCO2)c(Br)c1": 59,
  "Brc1ccc(OCc2ccccc2)c(Br)c1": 60,
  "Brc1ccc2[nH]c3ccc(Br)cc3c2c1": 61,
  "Brc1ccc2c(Br)ccnc2c1": 62,
  "Brc1ccc2c(c1)C1(CCOCC1)c1cc(Br)ccc1-2": 63,
  "Brc1ccc2c(c1)Cc1cc(Br)ccc1-2": 64,
  "Brc1ccc2c(c1)[nH]c1cc(Br)ccc12": 65,
  "Brc1ccc2c(c1)c1cc(Br)ccc1n2CC1CO1": 66,
  "Brc1ccc2c(c1)sc1cc(Br)ccc12": 67,
  "Brc1ccc2c3ccc(Br)cc3c3ccccc3c2c1": 68,
  "Brc1ccc2c3ccc(Br)cc3n(-c3ccccc3)c2c1": 69,
  "Brc1ccc2cc(Br)ccc2c1": 70,
  "Brc1ccc2ccc(Br)nc2c1": 71,
  "Brc1ccc2ccc3c(Br)ccc4ccc1c2c43": 72,
  "Brc1ccc2ccc3ccc(Br)nc3c2n1": 73,
  "Brc1ccc2cccc(Br)c2n1": 74,
  "Brc1ccc2n[nH]c(Br)c2c1": 75,
  "Brc1ccc2nc(Br)ccc2c1": 76,
  "Brc1ccc2nc(Br)ncc2c1": 77,
  "Brc1ccc2nc(Br)nn2c1": 78,
  "Brc1ccc2nc(Br)sc2c1": 79,
  "Brc1ccc2ncc(Br)n2c1": 80,
  "Brc1ccc2nccc(Br)c2c1": 81,
  "Brc1ccc2oc3ccc(Br)cc3c2c1": 82,
  "Brc1ccc2occ(Br)c2c1": 83,
  "Brc1ccc2sc(Br)nc2c1": 84,
  "Brc1cccc(-c2cccc(Br)n2)n1": 85,
  "Brc1cccc(Br)c1": 86,
  "Brc1cccc(Br)n1": 87,
  "Brc1cccc2c1oc1c(Br)cccc12": 88,
  "Brc1cccc2c1sc1c(Br)cccc12": 89,
  "Brc1ccccc1-c1ccccc1Br": 90,
  "Brc1ccccc1Br": 91,
  "Brc1ccn2nc(Br)nc2c1": 92,
  "Brc1ccnc(-c2cc(Br)ccn2)c1": 93,
  "Brc1ccnc(Br)c1": 94,
  "Brc1ccnc(Br)n1": 95,
  "Brc1ccnc2c(Br)cccc12": 96,
  "Brc1ccnc2c1ccc1c(Br)ccnc12": 97,
  "Brc1ccsc1-c1sccc1Br": 98,
  "Brc1ccsc1Br": 99,
  "Brc1cn2ccnc2c(Br)n1": 100,
  "Brc1cn2ncnc2c(Br)n1": 101,
  "Brc1cnc(Br)[nH]1": 102,
  "Brc1cnc(Br)c2ccccc12": 103,
  "Brc1cnc(Br)c2nsnc12": 104,
  "Brc1cnc(Br)cn1": 105,
  "Brc1cnc(Br)nc1": 106,
  "Brc1cnc(Br)s1": 107,
  "Brc1cnc(OCc2ccccc2)c(Br)c1": 108,
  "Brc1cnc2[nH]cc(Br)c2c1": 109,
  "Brc1cnc2[nH]cc(Br)c2n1": 110,
  "Brc1cnc2c(Br)ccnc2c1": 111,
  "Brc1cnc2c(Br)cnn2c1": 112,
  "Brc1cnc2c(ccc3cc(Br)cnc32)c1": 113,
  "Brc1cnc2cc(Br)cnc2c1": 114,
  "Brc1cnc2n[nH]c(Br)c2c1": 115,
  "Brc1cncc(Br)c1": 116,
  "Brc1cncc(Br)n1": 117,
  "Brc1cnnc(Br)c1": 118,
  "Brc1csc(Br)n1": 119,
  "Brc1csc2c(Br)csc12": 120,
  "Brc1cscc1Br": 121,
  "Brc1n[nH]c(Br)n1": 122,
  "Brc1nc(Br)c2ccccc2n1": 123,
  "Brc1nc(Br)n(C2CCCCO2)n1": 124,
  "Brc1nc(Br)n(Cc2ccccc2)n1": 125,
  "Brc1nc2cccc(Br)n2n1": 126,
  "Brc1nc2ccnc(Br)c2s1": 127,
  "Brc1ncc(Br)c2[nH]ccc12": 128,
  "Brc1ncc(Br)n2ccnc12": 129,
  "Brc1ncc(Br)n2ncnc12": 130,
  "Brc1nnc(Br)s1": 131,
  "Brc1sc(Br)c2c1OCCO2": 132,
  "CC(=O)Nc1c(Br)cc(Br)cc1C(C)=O": 133,
  "CC(=O)Nc1cc(Br)c([N+](=O)[O-])cc1Br": 134,
  "CC(=O)Nc1cc(Br)cc(Br)c1": 135,
  "CC(=O)Nc1cc(Br)ccc1Br": 136,
  "CC(=O)OCc1c(Br)cccc1Br": 137,
  "CC(=O)Oc1c(Br)cc(C=O)cc1Br": 138,
  "CC(=O)c1cc(Br)c(N)c(Br)c1": 139,
  "CC(=O)c1cc(Br)cc(Br)c1": 140,
  "CC(=O)c1cc(Br)cc(Br)c1N": 141,
  "CC(=O)c1cc(Br)sc1Br": 142,
  "CC(=O)c1ccc(Br)cc1Br": 143,
  "CC(=O)c1nc(Br)cnc1Br": 144,
  "CC(=S)Nc1cc(Br)ccc1Br": 145,
  "CC(C)(C)C(=O)Nc1cc(Br)cc(Br)c1": 146,
  "CC(C)(C)N=[N+]([O-])c1c(Br)cc(Br)cc1[N+](=O)[O-]": 147,
  "CC(C)(C)N=[N+]([O-])c1cc(Br)cc(Br)c1N": 148,
  "CC(C)(C)OC(=O)n1c(Br)ccc1Br": 149,
  "CC(C)(C)OC(=O)n1cc(Br)c2cc(Br)ccc21": 150,
  "CC(C)(C)Oc1ccc(Br)cc1Br": 151,
  "CC(C)(C)c1cc(Br)c(C(C)(C)C)cc1Br": 152,
  "CC(C)(C)c1cc(Br)c(Cl)c(Br)c1": 153,
  "CC(C)(C)c1cc(Br)c(N)c(Br)c1": 154,
  "CC(C)(C)c1cc(Br)c(O)c(Br)c1": 155,
  "CC(C)(C)c1cc2ccc3c(Br)cc(Br)c4ccc(c1)c2c34": 156,
  "CC(C)Oc1c(Br)cc(Br)cc1C=O": 157,
  "CC(C)Oc1c(Br)cc(C=CC(=O)O)cc1Br": 158,
  "CC(C)Oc1c(Br)cc(F)cc1Br": 159,
  "CC(C)Oc1cc(Br)cc(Br)c1": 160,
  "CC(C)c1cc(Br)c(N)c(Br)c1": 161,
  "CC(C)c1cc(Br)cc(Br)c1Cl": 162,
  "CC(C)c1cc(Br)cc(Br)c1N": 163,
  "CC(C)c1cc(Br)ccc1Br": 164,
  "CC(Oc1ccc(Br)cc1Br)C(=O)Cl": 165,
  "CC(Oc1ccc(Br)cc1Br)C(=O)NN": 166,
  "CC(Oc1ccc(Br)cc1Br)C(=O)O": 167,
  "CC1(C)C(=O)Nc2c(Br)cc(Br)cc21": 168,
  "CC1(C)c2cc(B(O)O)ccc2-c2ccc(B(O)O)cc21": 169,
  "CCCCCCCCc1cc(Br)sc1Br": 170,
  "CCCCCCc1cc(Br)sc1Br": 171,
  "CCCCOc1c(Br)cc(Br)cc1C=CC(=O)O": 172,
  "CCCCc1cc(Br)c(N)c(Br)c1": 173,
  "CCCCc1cc(Br)sc1Br": 174,
  "CCCOc1c(Br)cc(Br)cc1C=O": 175,
  "CCCOc1c(Br)cc(C=CC(=O)O)cc1Br": 176,
  "CCN1C(=O)C(=O)c2cc(Br)cc(Br)c21": 177,
  "CCOC(=O)c1c(Br)nn(C)c1Br": 178,
  "CCOC(=O)c1cc(Br)c(N)c(Br)c1": 179,
  "CCOC(=O)c1cc(Br)ccc1Br": 180,
  "CCOC(=O)c1cc(Br)sc1Br": 181,
  "CCOC(=O)c1ccc(Br)cc1Br": 182,
  "CCOC(=O)c1cn2cc(Br)nc(Br)c2n1": 183,
  "CCOC(=O)c1nc(Br)ccc1Br": 184,
  "CCOC(=O)c1nc(Br)cnc1Br": 185,
  "CCOC(=O)c1nc(Br)sc1Br": 186,
  "CCOc1c(Br)cc(Br)cc1C=CC(=O)O": 187,
  "CCOc1c(Br)cc(C=CC(=O)O)cc1Br": 188,
  "CCOc1c(Br)cc(F)cc1Br": 189,
  "CCOc1cc(Br)cc(Br)c1": 190,
  "CCOc1cc(N)c(Br)nc1Br": 191,
  "CCc1c(Br)cccc1Br": 192,
  "CCc1cc(Br)c(N)c(Br)c1": 193,
  "CCc1cc(Br)cc(Br)c1": 194,
  "CCc1cc(Br)cc(Br)c1Cl": 195,
  "CCc1cc(Br)cc(Br)c1N": 196,
  "CCc1cc(Br)cc(CC)c1Br": 197,
  "CCc1cc(Br)ccc1Br": 198,
  "CCc1cc(Br)sc1Br": 199,
  "CCc1ncc(Br)cc1Br": 200,
  "CCn1c2cc(Br)ccc2c2ccc(Br)cc21": 201,
  "CCn1c2ccc(Br)cc2c2cc(Br)ccc21": 202,
  "CN(C)c1ncc(Br)nc1Br": 203,
  "CN(Cc1cc(Br)cc(Br)c1N)C1CCCCC1": 204,
  "CN=[N+]([O-])c1cc(Br)cc(Br)c1N": 205,
  "COC(=O)C(N)Cc1cc(Br)c(O)c(Br)c1": 206,
  "COC(=O)COc1c(Br)cc(C=CC(=O)O)cc1Br": 207,
  "COC(=O)Cc1cc(Br)cc(Br)c1": 208,
  "COC(=O)c1c(Br)cc(Cl)c(N)c1Br": 209,
  "COC(=O)c1c(Br)cccc1Br": 210,
  "COC(=O)c1cc(Br)[nH]c1Br": 211,
  "COC(=O)c1cc(Br)c(Br)[nH]1": 212,
  "COC(=O)c1cc(Br)c(C(=O)OC)cc1Br": 213,
  "COC(=O)c1cc(Br)c(N)c(Br)n1": 214,
  "COC(=O)c1cc(Br)cc(Br)c1": 215,
  "COC(=O)c1cc(Br)cc(Br)n1": 216,
  "COC(=O)c1cc(Br)cc(C(=O)OC)c1Br": 217,
  "COC(=O)c1cc(Br)cnc1Br": 218,
  "COC(=O)c1cc(Br)nc(Br)c1": 219,
  "COC(=O)c1cc(Br)oc1Br": 220,
  "COC(=O)c1cc(Br)sc1Br": 221,
  "COC(=O)c1ccc(Br)cc1Br": 222,
  "COC(=O)c1nc(Br)[nH]c1Br": 223,
  "COC(=O)c1nc(Br)cc(Br)c1O": 224,
  "COC(=O)c1nc(Br)cc(Br)c1OC": 225,
  "COC(=O)c1nc(Br)ccc1Br": 226,
  "COC(=O)c1nc(Br)cnc1Br": 227,
  "COC(=O)c1nc(Br)sc1Br": 228,
  "COC(=O)c1nc(N)c(Br)cc1Br": 229,
  "COC(=O)c1ncc(Br)nc1Br": 230,
  "COCCOc1ccc(Br)cc1Br": 231,
  "COCn1nc(Br)nc1Br": 232,
  "COc1c(Br)cc(Br)c(F)c1F": 233,
  "COc1c(Br)cc(Br)c(OC)c1C(=O)O": 234,
  "COc1c(Br)cc(Br)c2cccnc12": 235,
  "COc1c(Br)cc(Br)cc1C#N": 236,
  "COc1c(Br)cc(Br)cc1C(=O)O": 237,
  "COc1c(Br)cc(C(=O)O)cc1Br": 238,
  "COc1c(Br)cc(C(N)=NO)cc1Br": 239,
  "COc1c(Br)cc(C=O)cc1Br": 240,
  "COc1c(Br)cc(CN)cc1Br": 241,
  "COc1c(Br)cc(Cl)c(N)c1Br": 242,
  "COc1c(Br)cc(Cl)cc1Br": 243,
  "COc1c(Br)cc(F)cc1Br": 244,
  "COc1c(Br)cc([N+](=O)[O-])c(C)c1Br": 245,
  "COc1c(Br)cccc1Br": 246,
  "COc1c(Br)cnc(N)c1Br": 247,
  "COc1c(Br)cncc1Br": 248,
  "COc1cc(Br)c(Br)c(C=O)c1O": 249,
  "COc1cc(Br)c(Br)cc1OC": 250,
  "COc1cc(Br)c(C)c(Br)c1": 251,
  "COc1cc(Br)c(Cl)c(Br)c1": 252,
  "COc1cc(Br)c(Cl)c(Br)c1N": 253,
  "COc1cc(Br)c(N)c(Br)c1": 254,
  "COc1cc(Br)c(O)c(Br)c1": 255,
  "COc1cc(Br)c(OC)cc1Br": 256,
  "COc1cc(Br)c2ncccc2c1Br": 257,
  "COc1cc(Br)cc(Br)c1": 258,
  "COc1cc(Br)cc(Br)c1N": 259,
  "COc1cc(Br)ccc1Br": 260,
  "COc1cc(Br)nc(Br)c1": 261,
  "COc1cc(C)c(Br)cc1Br": 262,
  "COc1cc(F)c(Br)cc1Br": 263,
  "COc1cc(N)c(Br)cc1Br": 264,
  "COc1cc(OC)c(Br)cc1Br": 265,
  "COc1cc([N+](=O)[O-])c(Br)nc1Br": 266,
  "COc1ccc(Br)cc1Br": 267,
  "COc1nc(Br)cc(Br)c1N": 268,
  "COc1ncc(Br)c(OC)c1Br": 269,
  "COc1ncc(Br)c2n[nH]c(Br)c12": 270,
  "COc1ncc(Br)cc1Br": 271,
  "CS(=O)(=O)c1cc(Br)c(N)c(Br)c1": 272,
  "CS(C)(=O)=Nc1c(Br)cc(Br)cc1[N+](=O)[O-]": 273,
  "Cc1[nH]c(=O)c(Br)cc1Br": 274,
  "Cc1[nH]c(Br)nc1Br": 275,
  "Cc1c(Br)cc(Br)c(=O)n1C": 276,
  "Cc1c(Br)cc(Br)c(N)c1C": 277,
  "Cc1c(Br)cc(Br)c(O)c1[N+](=O)[O-]": 278,
  "Cc1c(Br)cc(Br)cc1[N+](=O)[O-]": 279,
  "Cc1c(Br)cc(C=O)c(O)c1Br": 280,
  "Cc1c(Br)cc(Cl)c(Br)c1Cl": 281,
  "Cc1c(Br)cc(N)cc1Br": 282,
  "Cc1c(Br)cc(NCC(=O)NN)cc1Br": 283,
  "Cc1c(Br)cc(O)cc1Br": 284,
  "Cc1c(Br)cc(S(=O)(=O)C(F)(F)F)cc1Br": 285,
  "Cc1c(Br)ccc(Br)c1C": 286,
  "Cc1c(Br)ccc(Br)c1Cl": 287,
  "Cc1c(Br)ccc(Br)c1F": 288,
  "Cc1c(Br)ccc(Br)c1[N+](=O)[O-]": 289,
  "Cc1c(Br)ccc(N)c1Br": 290,
  "Cc1c(Br)ccnc1Br": 291,
  "Cc1c(Br)cnc(Br)c1[N+](=O)[O-]": 292,
  "Cc1c(Br)cnc(Cl)c1Br": 293,
  "Cc1c(Br)cnc(F)c1Br": 294,
  "Cc1c(Br)cnc(N)c1Br": 295,
  "Cc1c(Br)cncc1Br": 296,
  "Cc1c(Br)nc(Br)n1C": 297,
  "Cc1c(C)c(Br)c(C)c(C)c1Br": 298,
  "Cc1c(Cl)cc(Br)c(N)c1Br": 299,
  "Cc1c(F)cc(Br)c(N)c1Br": 300,
  "Cc1c(F)cc(Br)cc1Br": 301,
  "Cc1c(N)c(Br)cc(Br)c1Cl": 302,
  "Cc1c(N)c(Br)cc(Br)c1F": 303,
  "Cc1c(N)c(Br)cc(Br)c1[N+](=O)[O-]": 304,
  "Cc1c(N)cc(Br)cc1Br": 305,
  "Cc1cc(Br)c(C)c(Br)c1": 306,
  "Cc1cc(Br)c(C)cc1Br": 307,
  "Cc1cc(Br)c(C)nc1Br": 308,
  "Cc1cc(Br)c(Cl)c(Br)c1": 309,
  "Cc1cc(Br)c(Cl)c(Br)c1N": 310,
  "Cc1cc(Br)c(Cl)cc1Br": 311,
  "Cc1cc(Br)c(F)c(Br)c1": 312,
  "Cc1cc(Br)c(F)c(Br)c1N": 313,
  "Cc1cc(Br)c(I)c(Br)c1[N+](=O)[O-]": 314,
  "Cc1cc(Br)c(N)c(Br)c1": 315,
  "Cc1cc(Br)c(N)c(Br)c1C": 316,
  "Cc1cc(Br)c(N)c(Br)c1Cl": 317,
  "Cc1cc(Br)c(N)c(Br)c1[N+](=O)[O-]": 318,
  "Cc1cc(Br)c(N)c(Br)n1": 319,
  "Cc1cc(Br)c(N)cc1Br": 320,
  "Cc1cc(Br)c(NCC(=O)NN)c(Br)c1": 321,
  "Cc1cc(Br)c(O)c(Br)c1": 322,
  "Cc1cc(Br)c(O)c(Br)n1": 323,
  "Cc1cc(Br)c([N+](=O)[O-])c(Br)c1": 324,
  "Cc1cc(Br)c([N+](=O)[O-])c(Br)c1N": 325,
  "Cc1cc(Br)c([N+](=O)[O-])cc1Br": 326,
  "Cc1cc(Br)c2ncc(Br)n2c1": 327,
  "Cc1cc(Br)cc(Br)c1": 328,
  "Cc1cc(Br)cc(Br)c1C": 329,
  "Cc1cc(Br)cc(Br)c1Cl": 330,
  "Cc1cc(Br)cc(Br)c1F": 331,
  "Cc1cc(Br)cc(Br)c1N": 332,
  "Cc1cc(Br)cc(Br)c1[N+](=O)[O-]": 333,
  "Cc1cc(Br)cc(Br)n1": 334,
  "Cc1cc(Br)cc(C)c1Br": 335,
  "Cc1cc(Br)cc([N+](=O)[O-])c1Br": 336,
  "Cc1cc(Br)ccc1Br": 337,
  "Cc1cc(Br)nc(Br)c1": 338,
  "Cc1cc(Br)nc(Br)c1N": 339,
  "Cc1cc(Br)ncc1Br": 340,
  "Cc1cc(Br)nnc1Br": 341,
  "Cc1cc(C)c(Br)cc1Br": 342,
  "Cc1cc(C)c(Br)nc1Br": 343,
  "Cc1cc(N)c(Br)c(C)c1Br": 344,
  "Cc1cc(N)c(Br)cc1Br": 345,
  "Cc1cc(N)c(Br)nc1Br": 346,
  "Cc1ccc(-c2ccc3cc(Br)cc(Br)c3n2)cc1": 347,
  "Cc1ccc(Br)c(Br)c1": 348,
  "Cc1ccc(Br)c(C)c1Br": 349,
  "Cc1ccc(Br)cc1Br": 350,
  "Cc1ccc(Br)nc1Br": 351,
  "Cc1cn2cc(Br)nc(Br)c2n1": 352,
  "Cc1nc(Br)ccc1Br": 353,
  "Cc1nc(Br)n(C)c1Br": 354,
  "Cc1nc(Br)ncc1Br": 355,
  "Cc1nc(Br)sc1Br": 356,
  "Cc1nc(C)c(Br)c(C)c1Br": 357,
  "Cc1nc(C)c(Br)cc1Br": 358,
  "Cc1nc(Cl)c(Br)cc1Br": 359,
  "Cc1nc(F)c(Br)cc1Br": 360,
  "Cc1nc(N)c(Br)cc1Br": 361,
  "Cc1nc(N)c(Br)nc1Br": 362,
  "Cc1nc2[nH]cc(Br)c2cc1Br": 363,
  "Cc1ncc(Br)c(C)c1Br": 364,
  "Cc1ncc(Br)cc1Br": 365,
  "Cc1sc(Br)c(C)c1Br": 366,
  "Cc1sc(Br)cc1Br": 367,
  "Cc1sc(Br)nc1Br": 368,
  "ClCc1cc(Br)ccc1Br": 369,
  "Clc1c(Br)ccc(Br)c1Cl": 370,
  "Clc1c(Br)cccc1Br": 371,
  "Clc1c(Br)cncc1Br": 372,
  "Clc1cc(Br)c(Cl)c(Br)c1": 373,
  "Clc1cc(Br)c(Cl)cc1Br": 374,
  "Clc1cc(Br)c2ncc(Br)n2c1": 375,
  "Clc1cc(Br)c2ncc(Br)n2n1": 376,
  "Clc1cc(Br)cc(Br)c1Cl": 377,
  "Clc1cc(Br)cnc1Br": 378,
  "Clc1cc(Br)nc(Br)c1": 379,
  "Clc1ccc(Br)c(Cl)c1Br": 380,
  "Clc1ccc(Br)cc1Br": 381,
  "Clc1cnc(Br)cc1Br": 382,
  "Clc1cnc2c(Br)nc(Br)cn12": 383,
  "Clc1nc(Br)ccc1Br": 384,
  "Clc1nc2c(Br)cc(Br)cc2s1": 385,
  "Clc1nc2c(Br)ccc(Br)c2s1": 386,
  "Clc1ncc(Br)nc1Br": 387,
  "Clc1ncnc2c(Br)cc(Br)cc12": 388,
  "Cn1c(Br)cnc1Br": 389,
  "Cn1c(Br)nc(C#N)c1Br": 390,
  "Cn1c(Br)nc(F)c1Br": 391,
  "Cn1cc(Br)c(=O)c(Br)c1": 392,
  "Cn1cc(Br)cc(Br)c1=O": 393,
  "Cn1cc(Br)nc(Br)c1=O": 394,
  "Cn1cc(Br)nc1Br": 395,
  "Cn1nc(Br)c([N+](=O)[O-])c1Br": 396,
  "Cn1nc(Br)nc1Br": 397,
  "FC(F)(F)Cc1cc(Br)cc(Br)c1": 398,
  "FC(F)(F)Oc1cc(Br)cc(Br)c1": 399,
  "FC(F)(F)Oc1cc(Br)cc(Br)c1Cl": 400,
  "FC(F)(F)Oc1cc(Br)cc(Br)c1N=C=S": 401,
  "FC(F)(F)Oc1ccc(Br)c(Br)c1": 402,
  "FC(F)(F)c1[nH]c(Br)nc1Br": 403,
  "FC(F)(F)c1c(Br)cccc1Br": 404,
  "FC(F)(F)c1cc(Br)cc(Br)c1": 405,
  "FC(F)(F)c1cc(Br)cc(Br)c1Cl": 406,
  "FC(F)(F)c1cc(Br)ccc1Br": 407,
  "FC(F)(F)c1cc(Br)cnc1Br": 408,
  "FC(F)(F)c1cc(Br)nc(Br)c1": 409,
  "FC(F)(F)c1cc(Br)ncc1Br": 410,
  "FC(F)(F)c1ccc(Br)cc1Br": 411,
  "FC(F)Oc1cc(Br)c(Cl)c(Br)c1": 412,
  "FC(F)Oc1cc(Br)cc(Br)c1": 413,
  "FC(F)Oc1cc(Br)ccc1Br": 414,
  "FC(F)c1cc(Br)cc(Br)c1": 415,
  "Fc1c(Br)cc(Cl)cc1Br": 416,
  "Fc1c(Br)ccc(Br)c1Cl": 417,
  "Fc1c(Br)ccc(Br)c1F": 418,
  "Fc1c(Br)cccc1Br": 419,
  "Fc1c(Cl)cc(Br)cc1Br": 420,
  "Fc1c(F)c(-c2c(F)c(F)c(Br)c(F)c2F)c(F)c(F)c1Br": 421,
  "Fc1c(F)c(Br)c(F)c(Br)c1F": 422,
  "Fc1c(F)c(Br)c(F)c(F)c1Br": 423,
  "Fc1c(F)c(Br)c2nsnc2c1Br": 424,
  "Fc1cc(Br)c(Br)cc1F": 425,
  "Fc1cc(Br)c(Cl)c(Br)c1": 426,
  "Fc1cc(Br)c(Cl)cc1Br": 427,
  "Fc1cc(Br)c(F)c(Br)c1": 428,
  "Fc1cc(Br)c(F)cc1Br": 429,
  "Fc1cc(Br)c2nsnc2c1Br": 430,
  "Fc1cc(Br)cc(Br)c1": 431,
  "Fc1cc(Br)cc(Br)c1Cl": 432,
  "Fc1cc(Br)cc(Br)c1F": 433,
  "Fc1cc(Br)cc(Cl)c1Br": 434,
  "Fc1cc(Br)cc(F)c1Br": 435,
  "Fc1cc(Br)ccc1Br": 436,
  "Fc1cc(Br)cnc1Br": 437,
  "Fc1cc(Br)nc(Br)c1": 438,
  "Fc1cc(Br)ncc1Br": 439,
  "Fc1cc(Cl)c(Br)cc1Br": 440,
  "Fc1cc(F)c(Br)c(F)c1Br": 441,
  "Fc1cc(F)c(Br)cc1Br": 442,
  "Fc1ccc(Br)c(F)c1Br": 443,
  "Fc1ccc(Br)cc1Br": 444,
  "Fc1ccc(Br)nc1Br": 445,
  "Fc1cnc(Br)cc1Br": 446,
  "Fc1ncc(Br)cc1Br": 447,
  "N#CC(C#N)=C1c2cc(Br)ccc2-c2ccc(Br)cc21": 448,
  "N#CCC(=O)Nc1ccc(Br)cc1Br": 449,
  "N#CCc1c(Br)cccc1Br": 450,
  "N#CCc1cc(Br)cc(Br)c1": 451,
  "N#CCc1cc(Br)ccc1Br": 452,
  "N#CCc1ccc(Br)cc1Br": 453,
  "N#Cc1c(Br)cccc1Br": 454,
  "N#Cc1c(Br)ccnc1Br": 455,
  "N#Cc1c(Br)cncc1Br": 456,
  "N#Cc1c(F)cc(Br)cc1Br": 457,
  "N#Cc1c(N)c(Br)cc(Br)c1Cl": 458,
  "N#Cc1c(N)c(Br)cc(Br)c1F": 459,
  "N#Cc1cc(Br)c(F)cc1Br": 460,
  "N#Cc1cc(Br)c(O)c(Br)c1": 461,
  "N#Cc1cc(Br)c(O)cc1Br": 462,
  "N#Cc1cc(Br)cc(Br)c1": 463,
  "N#Cc1cc(Br)cc(Br)c1F": 464,
  "N#Cc1cc(Br)cc(Br)c1N": 465,
  "N#Cc1cc(Br)cc(Br)c1O": 466,
  "N#Cc1cc(Br)ccc1Br": 467,
  "N#Cc1cc(Br)cnc1Br": 468,
  "N#Cc1ncc(Br)cc1Br": 469,
  "NC(=O)c1ccc(Br)cc1Br": 470,
  "NC(=S)c1cc(Br)cc(Br)c1": 471,
  "NC(Cc1cc(Br)c(O)c(Br)c1)C(=O)O": 472,
  "NC1CCOc2cc(Br)cc(Br)c21": 473,
  "NCc1c(Br)cccc1Br": 474,
  "NCc1cc(Br)ccc1Br": 475,
  "NNC(=O)COc1ccc(Br)cc1Br": 476,
  "NNC(=O)c1cc(Br)c(O)c(Br)c1": 477,
  "NNc1cc(Br)ccc1Br": 478,
  "Nc1c(Br)c(Cl)c(F)c(Cl)c1Br": 479,
  "Nc1c(Br)cc(Br)c(Cl)c1Cl": 480,
  "Nc1c(Br)cc(Br)c(F)c1C(=O)O": 481,
  "Nc1c(Br)cc(Br)cc1C(F)(F)F": 482,
  "Nc1c(Br)cc(Br)cc1CNC1CCC(O)CC1": 483,
  "Nc1c(Br)cc(Br)cc1CO": 484,
  "Nc1c(Br)cc(Br)cc1OC(F)(F)F": 485,
  "Nc1c(Br)cc(Br)cc1OC(F)F": 486,
  "Nc1c(Br)cc(C(=O)O)cc1Br": 487,
  "Nc1c(Br)cc(C(F)(F)F)cc1Br": 488,
  "Nc1c(Br)cc(C(F)(F)F)nc1Br": 489,
  "Nc1c(Br)cc(Cl)c(F)c1Br": 490,
  "Nc1c(Br)cc(F)c(Cl)c1Br": 491,
  "Nc1c(Br)cc(F)c(F)c1Br": 492,
  "Nc1c(Br)cc(F)cc1Br": 493,
  "Nc1c(Br)cc(O)cc1Br": 494,
  "Nc1c(Br)cc(OC(F)F)cc1Br": 495,
  "Nc1c(Br)cc(S(N)(=O)=O)cc1Br": 496,
  "Nc1c(Br)cc2[nH]cnc2c1Br": 497,
  "Nc1c(Br)cc2c(c1Br)OC(F)(F)O2": 498,
  "Nc1c(Br)ccc(Br)c1N": 499,
  "Nc1c(Br)ccnc1Br": 500,
  "Nc1c(Br)cnc(Br)c1N": 501,
  "Nc1c(Br)cnc(Cl)c1Br": 502,
  "Nc1c(Br)cncc1Br": 503,
  "Nc1c(Cl)cc(Br)c(Cl)c1Br": 504,
  "Nc1c(Cl)cc(Br)c(F)c1Br": 505,
  "Nc1c(F)cc(Br)c(C(F)(F)F)c1Br": 506,
  "Nc1c(F)cc(Br)c(Cl)c1Br": 507,
  "Nc1c(F)cc(Br)c(F)c1Br": 508,
  "Nc1c(F)cc(Br)cc1Br": 509,
  "Nc1cc(Br)c(F)c(Br)c1": 510,
  "Nc1cc(Br)c(F)cc1Br": 511,
  "Nc1cc(Br)c([N+](=O)[O-])cc1Br": 512,
  "Nc1cc(Br)cc(Br)c1": 513,
  "Nc1cc(Br)cc(Br)c1C(=O)O": 514,
  "Nc1cc(Br)cc(Br)n1": 515,
  "Nc1cc(Br)ccc1Br": 516,
  "Nc1cc(Br)cnc1Br": 517,
  "Nc1cc(Br)nc(Br)c1": 518,
  "Nc1cc(Br)nc(Br)c1[N+](=O)[O-]": 519,
  "Nc1cc(Br)ncc1Br": 520,
  "Nc1cc(Cl)c(Br)c(Cl)c1Br": 521,
  "Nc1cc(F)c(Br)c(F)c1Br": 522,
  "Nc1cc(F)c(Br)cc1Br": 523,
  "Nc1cc2cc(Br)ccc2c(Br)n1": 524,
  "Nc1ccc(Br)c(F)c1Br": 525,
  "Nc1ccc(Br)cc1Br": 526,
  "Nc1ccc(Br)nc1Br": 527,
  "Nc1cnc(Br)cc1Br": 528,
  "Nc1n[nH]c2cc(Br)cc(Br)c12": 529,
  "Nc1nc(Br)cc(Br)n1": 530,
  "Nc1nc(Br)ccc1Br": 531,
  "Nc1nc(Br)cnc1Br": 532,
  "Nc1nc(Cl)c(Br)cc1Br": 533,
  "Nc1nc(Cl)c(Br)nc1Br": 534,
  "Nc1nc2c(Br)cc(Br)cc2s1": 535,
  "Nc1ncc(Br)c(C(F)(F)F)c1Br": 536,
  "Nc1ncc(Br)cc1Br": 537,
  "Nc1ncc2cc(-c3c(Br)cccc3Br)c(N)nc2n1": 538,
  "Nc1nnc(Br)cc1Br": 539,
  "O=C(Cl)COc1ccc(Br)cc1Br": 540,
  "O=C(Cl)c1cc(Br)c(C(=O)Cl)cc1Br": 541,
  "O=C(Cl)c1cc(Br)cc(Br)c1": 542,
  "O=C(Nc1cc(Br)ccc1Br)c1ccccc1": 543,
  "O=C(O)CCc1cc(Br)c(O)c(Br)c1": 544,
  "O=C(O)Cc1c(Br)cccc1Br": 545,
  "O=C(O)Cc1cc(Br)c(O)c(Br)c1": 546,
  "O=C(O)Cc1cc(Br)cc(Br)c1": 547,
  "O=C(O)Cc1cc(Br)ccc1Br": 548,
  "O=C(O)Cc1ccc(Br)cc1Br": 549,
  "O=C(O)c1c(Br)c(O)cc(O)c1Br": 550,
  "O=C(O)c1c(Br)cccc1Br": 551,
  "O=C(O)c1c(Br)cncc1Br": 552,
  "O=C(O)c1c(Br)sc(Br)c1C(=O)O": 553,
  "O=C(O)c1c(F)cc(Br)cc1Br": 554,
  "O=C(O)c1c[nH]c2c(Br)cnc(Br)c12": 555,
  "O=C(O)c1cc(-c2ccccc2)nc2c(Br)cc(Br)cc12": 556,
  "O=C(O)c1cc(Br)c(C(=O)O)cc1Br": 557,
  "O=C(O)c1cc(Br)c(O)c(Br)c1": 558,
  "O=C(O)c1cc(Br)c(O)c(Br)n1": 559,
  "O=C(O)c1cc(Br)c(O)cc1Br": 560,
  "O=C(O)c1cc(Br)cc(Br)c1": 561,
  "O=C(O)c1cc(Br)ccc1Br": 562,
  "O=C(O)c1cc(Br)cnc1Br": 563,
  "O=C(O)c1cc(Br)nc(Br)c1": 564,
  "O=C(O)c1cc(Br)ncc1Br": 565,
  "O=C(O)c1cc(Br)oc1Br": 566,
  "O=C(O)c1cc(Br)sc1Br": 567,
  "O=C(O)c1cc(Cl)c(Br)nc1Br": 568,
  "O=C(O)c1cc(O)c(Br)cc1Br": 569,
  "O=C(O)c1cc2c(Br)sc(Br)c2s1": 570,
  "O=C(O)c1ccc(Br)c(Br)n1": 571,
  "O=C(O)c1ccc(Br)c(OC(F)F)c1Br": 572,
  "O=C(O)c1ccc(Br)cc1Br": 573,
  "O=C(O)c1ccc(Br)nc1Br": 574,
  "O=C(O)c1cccc(Br)c1Br": 575,
  "O=C(O)c1cnc(Br)cc1Br": 576,
  "O=C(O)c1cncc(Br)c1Br": 577,
  "O=C(O)c1nc(Br)ccc1Br": 578,
  "O=C(O)c1nc(Br)cnc1Br": 579,
  "O=C(O)c1nc(Br)sc1Br": 580,
  "O=C(O)c1sc(Br)cc1Br": 581,
  "O=C(O)c1sc(Br)nc1Br": 582,
  "O=C(c1ccc(Br)cc1)c1ccc(Br)cc1": 583,
  "O=C1C(=O)c2cc(Br)ccc2-c2ccc(Br)cc21": 584,
  "O=C1C=C(Br)C(=O)C=C1Br": 585,
  "O=C1CCOc2cc(Br)cc(Br)c21": 586,
  "O=C1CCc2cc(Br)cc(Br)c2N1": 587,
  "O=C1Cc2cc(Br)cc(Br)c2N1": 588,
  "O=C1Nc2c(Br)cc(Br)cc2C1=O": 589,
  "O=C1Nc2cc(Br)cc(Br)c2C1=O": 590,
  "O=C1OC(=O)c2c(Br)sc(Br)c21": 591,
  "O=C1OC(=O)c2cc(Br)c(Br)cc21": 592,
  "O=C1c2cc(Br)ccc2-c2ccc(Br)cc21": 593,
  "O=C1c2cc(Br)sc2-c2sc(Br)cc21": 594,
  "O=C1c2ccc(Br)cc2C(=O)c2ccc(Br)cc21": 595,
  "O=Cc1c(Br)cc(F)cc1Br": 596,
  "O=Cc1c(Br)ccc(Br)c1F": 597,
  "O=Cc1c(Br)ccnc1Br": 598,
  "O=Cc1c(Br)cncc1Br": 599,
  "O=Cc1c(F)cc(Br)cc1Br": 600,
  "O=Cc1cc(Br)c(C=O)cc1Br": 601,
  "O=Cc1cc(Br)cc(Br)c1": 602,
  "O=Cc1cc(Br)cc(Br)c1F": 603,
  "O=Cc1cc(Br)cc(Br)c1OCc1ccccc1": 604,
  "O=Cc1cc(Br)ccc1Br": 605,
  "O=Cc1cc(Br)nc(Br)c1": 606,
  "O=Cc1cc(Br)ncc1Br": 607,
  "O=Cc1cc(Br)sc1Br": 608,
  "O=Cc1ccc(Br)cc1Br": 609,
  "O=Cc1ccc(Br)nc1Br": 610,
  "O=Cc1cnc(Br)cc1Br": 611,
  "O=Cc1nc(Br)cnc1Br": 612,
  "O=Cc1sc(Br)nc1Br": 613,
  "O=S1(=O)C(Br)=CC=C1Br": 614,
  "O=S1(=O)c2cc(B(O)O)ccc2-c2ccc(B(O)O)cc21": 615,
  "O=S1(=O)c2cc(Br)ccc2-c2ccc(Br)cc21": 616,
  "O=S1(=O)c2ccc(Br)cc2-c2cc(Br)ccc21": 617,
  "O=[N+]([O-])c1c(Br)c(F)cc(F)c1Br": 618,
  "O=[N+]([O-])c1c(Br)cc(Cl)cc1Br": 619,
  "O=[N+]([O-])c1c(Br)cccc1Br": 620,
  "O=[N+]([O-])c1c(Br)ccnc1Br": 621,
  "O=[N+]([O-])c1c(Br)n[nH]c1Br": 622,
  "O=[N+]([O-])c1c(Br)sc(Br)c1[N+](=O)[O-]": 623,
  "O=[N+]([O-])c1c(F)c(Br)cc(F)c1Br": 624,
  "O=[N+]([O-])c1cc(Br)c(F)c(Br)c1": 625,
  "O=[N+]([O-])c1cc(Br)c(F)c(Br)c1O": 626,
  "O=[N+]([O-])c1cc(Br)c(F)cc1Br": 627,
  "O=[N+]([O-])c1cc(Br)c2ncc(Br)cc2c1": 628,
  "O=[N+]([O-])c1cc(Br)cc(Br)c1": 629,
  "O=[N+]([O-])c1cc(Br)cc2c1[nH]c1ccc(Br)cc12": 630,
  "O=[N+]([O-])c1cc(Br)ccc1Br": 631,
  "O=[N+]([O-])c1cc(Br)cnc1Br": 632,
  "O=[N+]([O-])c1cc(Br)nc(Br)c1": 633,
  "O=[N+]([O-])c1cc(Br)ncc1Br": 634,
  "O=[N+]([O-])c1ccc(Br)c(F)c1Br": 635,
  "O=[N+]([O-])c1ccc(Br)cc1Br": 636,
  "O=[N+]([O-])c1cnc(Br)cc1Br": 637,
  "O=[N+]([O-])c1nc(Br)[nH]c1Br": 638,
  "O=[N+]([O-])c1ncc(Br)cc1Br": 639,
  "O=c1[nH][nH]c2cc(Br)cc(Br)c12": 640,
  "O=c1[nH]c(Cl)c(Br)cc1Br": 641,
  "O=c1[nH]cc(Br)c(C(F)(F)F)c1Br": 642,
  "O=c1[nH]cc(Br)nc1Br": 643,
  "O=c1c(Br)c[nH]cc1Br": 644,
  "O=c1cc(Br)[nH]c(Br)c1": 645,
  "O=c1oc(=O)c2c(Br)c3c(=O)oc(=O)c3c(Br)c12": 646,
  "OB(O)c1cc(F)c(B(O)O)cc1F": 647,
  "OB(O)c1cc2cc3sc(B(O)O)cc3cc2s1": 648,
  "OB(O)c1cc2ccc3cc(B(O)O)cc4ccc(c1)c2c34": 649,
  "OB(O)c1ccc(-c2ccc(B(O)O)s2)s1": 650,
  "OB(O)c1ccc(B(O)O)c2nsnc12": 651,
  "OB(O)c1ccc(B(O)O)cc1": 652,
  "OB(O)c1ccc2c(c1)[nH]c1cc(B(O)O)ccc12": 653,
  "OC(CNc1ccccc1)Cn1c2ccc(Br)cc2c2cc(Br)ccc21": 654,
  "OCc1c(Br)cc(F)cc1Br": 655,
  "OCc1c(Br)cccc1Br": 656,
  "OCc1cc(Br)cc(Br)c1": 657,
  "OCc1cc(Br)ccc1Br": 658,
  "OCc1cc(Br)ncc1Br": 659,
  "OCc1ccc(Br)cc1Br": 660,
  "OCc1ccc(Br)nc1Br": 661,
  "OCc1ncc(Br)cc1Br": 662,
  "OCc1sc(Br)nc1Br": 663,
  "Oc1c(Br)cc(Br)c(F)c1F": 664,
  "Oc1c(Br)cc(Br)c2cccnc12": 665,
  "Oc1c(Br)cc(Br)cc1CBr": 666,
  "Oc1c(Br)cc(C(F)(F)F)cc1Br": 667,
  "Oc1c(Br)cc(Cl)cc1Br": 668,
  "Oc1c(Br)cc(F)cc1Br": 669,
  "Oc1c(Br)cc(F)nc1Br": 670,
  "Oc1cc(Br)c(O)cc1Br": 671,
  "Oc1cc(Br)cc(Br)c1": 672,
  "Oc1cc(Br)ccc1Br": 673,
  "Oc1cc(Br)cnc1Br": 674,
  "Oc1cc(O)c(Br)c(O)c1Br": 675,
  "Oc1ccc(Br)cc1Br": 676,
  "Oc1ccc(Br)nc1Br": 677,
  "Oc1ccc2cc(Br)ccc2c1-c1c(O)ccc2cc(Br)ccc12": 678,
  "Oc1ccccc1-c1ccc2cc(Br)cc(Br)c2n1": 679,
  "S=C(Nc1cc(Br)ccc1Br)c1ccccc1": 680,
  "S=C=Nc1cc(Br)ccc1Br": 681,
  "S=C=Nc1ccc(Br)cc1Br": 682,
  "Sc1cc(Br)ccc1Br": 683,
  "Sc1ccc(Br)cc1Br": 684,
  "[C-]#[N+]c1c(Br)cc(C)cc1Br": 685,
  "[C-]#[N+]c1c(Br)cc(F)cc1Br": 686,
  "[C-]#[N+]c1c(C)cc(Br)cc1Br": 687,
  "[C-]#[N+]c1ccc(Br)cc1Br": 688,
  "[O-][n+]1c(Br)cccc1Br": 689,
  "[O-][n+]1cc(Br)cc(Br)c1": 690,
  "[O-][n+]1cc(Br)ccc1Br": 691
}