{
  "*C/C=C/C*": 1,
  "*C/C=C\\C*": 2,
  "*Cc1ccc(C*)cc1": 3,
  "*Cc1ccc(Oc2c(F)c(F)c(Oc3ccc(C*)cc3)c(F)c2F)cc1": 4,
  "*N(*)c1ccc(-n2c3ccccc3c3ccccc32)cc1": 5,
  "*N(c1ccccc1)c1ccc(S(=O)(=O)c2ccc(N(*)c3ccccc3)cc2)cc1": 6,
  "*OC1COC2C(O*)COC12": 7,
  "*OCC(F)(CO*)C(F)(F)C(F)(F)C(F)(F)C(F)(F)F": 8,
  "*OCC(F)(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)CO*": 9,
  "*OCC(F)(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)CO*": 10,
  "*OCC(F)(F)C(F)(F)C(F)(F)C(F)(F)CO*": 11,
  "*OCC(F)(F)C(F)(F)C(F)(F)CO*": 12,
  "*OCC(F)(F)C(F)(F)CO*": 13,
  "*OCCN(CCO*)c1ccc(/C=C/c2cccs2)cc1": 14,
  "*OCCN(CCO*)c1ccc(/N=N/c2ccc([N+](=O)[O-])cc2)cc1": 15,
  "*Oc1c(-c2ccccc2)c(-c2ccccc2)c(O*)c(-c2ccccc2)c1-c1ccccc1": 16,
  "*Oc1c(-c2ccccc2)cc(-c2cc(-c3ccccc3)c(O*)c(-c3ccccc3)c2-c2ccccc2)c(-c2ccccc2)c1-c1ccccc1": 17,
  "*Oc1c(-c2ccccc2)cc(-c2cc(-c3ccccc3)c(O*)c(-c3ccccc3)c2C)c(C)c1-c1ccccc1": 18,
  "*Oc1c(-c2ccccc2)cc(-c2cc(-c3ccccc3)c(O*)c(-c3ccccc3)c2Cl)cc1-c1ccccc1": 19,
  "*Oc1c(-c2ccccc2)cc(-c2cc(-c3ccccc3)c(Oc3ccc(C(=O)c4ccc(Oc5c(-c6ccccc6)cc(-c6cc(-c7ccccc7)c(O*)c(-c7ccccc7)c6-c6ccccc6)c(-c6ccccc6)c5-c5ccccc5)cc4)cc3)c(-c3ccccc3)c2-c2ccccc2)c(-c2ccccc2)c1-c1ccccc1": 20,
  "*Oc1c(-c2ccccc2)cc(-c2nn(*)c(=O)c3ccccc23)c(-c2ccccc2)c1-c1ccccc1": 21,
  "*Oc1c(-c2ccccc2)cc(-c2nn(*)c(=O)c3ccccc23)cc1-c1ccccc1": 22,
  "*Oc1c(-c2ccccc2)cc(C2(c3cc(-c4ccccc4)c(O*)c(-c4ccccc4)c3)c3ccccc3-c3ccccc32)cc1-c1ccccc1": 23,
  "*Oc1c(-c2ccccc2)cc(C23CC4CC(C2)CC(c2cc(-c5ccccc5)c(O*)c(-c5ccccc5)c2)(C4)C3)cc1-c1ccccc1": 24,
  "*Oc1c(C(C)C)cc(-c2nn(*)c(=O)c3ccccc23)cc1C(C)C": 25,
  "*Oc1c(C)c(C)c(O*)c(C)c1C": 26,
  "*Oc1c(C)cc(-c2cc(C)c(O*)c(C)c2)cc1C": 27,
  "*Oc1c(C)cc(-c2cc(C)c(O*)c(C)c2C)c(C)c1C": 28,
  "*Oc1c(C)cc(-c2nn(*)c(=O)c3ccccc23)cc1C": 29,
  "*Oc1c(C)cc(C(C)(C)c2cc(C)c(O*)c(C)c2)cc1C": 30,
  "*Oc1c(C)cc(C(C)(C)c2ccc(C(C)(C)c3cc(C)c(O*)c(C)c3)cc2)cc1C": 31,
  "*Oc1c(C)cc(C(c2cc(C(F)(F)F)cc(C(F)(F)F)c2)(c2cc(C)c(O*)c(C)c2)C(F)(F)F)cc1C": 32,
  "*Oc1c(C)cc(C(c2cc(C)c(O*)c(C(C)C)c2)c2ccccc2C(=O)O)cc1C(C)C": 33,
  "*Oc1c(C)cc(C(c2cc(C)c(O*)c(C)c2)c2ccc3ccccc3c2)cc1C": 34,
  "*Oc1c(C)cc(C(c2cc(C)c(O*)c(C)c2)c2cccc3ccccc23)cc1C": 35,
  "*Oc1c(C)cc(C(c2ccc(-c3ccccc3)cc2)c2cc(C)c(O*)c(C)c2)cc1C": 36,
  "*Oc1c(C)cc(C(c2cccc(C(F)(F)F)c2)(c2cc(C)c(O*)c(C)c2)C(F)(F)F)cc1C": 37,
  "*Oc1c(C)cc(C(c2ccccc2)(c2ccccc2)c2cc(C)c(O*)c(C)c2)cc1C": 38,
  "*Oc1c(C)cc(C(c2ccccc2)c2cc(C)c(O*)c(C)c2)cc1C": 39,
  "*Oc1c(C)cc(C2(c3cc(C)c(O*)c(C)c3)CCC3CCCCC3C2)cc1C": 40,
  "*Oc1c(C)cc(C2(c3cc(C)c(O*)c(C)c3)c3ccccc3-c3ccccc32)cc1C": 41,
  "*Oc1c(C)cc(C2(c3cc(C)c(O*)c(C)c3)c3ccccc3Oc3ccccc32)cc1C": 42,
  "*Oc1c(C)cc(Cc2cc(C)c(O*)c(C)c2)cc1C": 43,
  "*Oc1c(C)cc(Oc2c(C)cc(C(C)(C)c3cc(C)c(Oc4cc(C)c(O*)c(C)c4)c(C)c3)cc2C)cc1C": 44,
  "*Oc1c(C)cc(S(=O)(=O)c2cc(C)c(O*)c(C)c2)cc1C": 45,
  "*Oc1c(OC)cc(C(c2cc(OC)c(O*)c(OC)c2)c2ccco2)cc1OC": 46,
  "*Oc1c(OC)cc(C2(c3cc(OC)c(O*)c(OC)c3)c3ccccc3-c3ccccc32)cc1OC": 47,
  "*Oc1cc(-c2ccccc2)c(O*)c(-c2ccccc2)c1": 48,
  "*Oc1cc(-c2ccccc2)c(O*)c(-c2ccccc2)c1-c1ccccc1": 49,
  "*Oc1cc(-c2ccccc2)c(O*)c(-c2ccccc2)c1C": 50,
  "*Oc1cc(-c2ccccc2)c(Oc2c(-c3ccccc3)cc(O*)cc2-c2ccccc2)c(-c2ccccc2)c1": 51,
  "*Oc1cc(C(C)(C)C)c(O*)cc1C(C)(C)C": 52,
  "*Oc1cc(C(c2ccco2)c2cc(O*)c(OC)cc2CC=C)c(CC=C)cc1OC": 53,
  "*Oc1cc(C)c(-c2nn(*)c(=O)c3ccccc23)cc1C": 54,
  "*Oc1cc(C)c(C(c2cc(C(C)C)c(O*)cc2C)c2ccccc2C(=O)O)cc1C(C)C": 55,
  "*Oc1cc(C)c(C2(c3cc(C(C)C)c(O*)cc3C)OC(=O)c3ccccc32)cc1C(C)C": 56,
  "*Oc1cc(C)c(C2(c3cc(C)c(O*)cc3C)OC(=O)c3ccccc32)cc1C": 57,
  "*Oc1cc(C)c(O*)c(C)c1C": 58,
  "*Oc1cc(N(c2ccccc2)c2ccccc2)c(O*)cc1N(c1ccccc1)c1ccccc1": 59,
  "*Oc1cc(O*)c(Cl)cc1Cl": 60,
  "*Oc1cc(O*)cc(C(=O)O)c1": 61,
  "*Oc1cc2ccccc2cc1O*": 62,
  "*Oc1ccc(-c2[nH]c(-c3ccc(O*)cc3)c(-c3ccccc3)c2-c2ccccc2)cc1": 63,
  "*Oc1ccc(-c2c(-c3ccccc3)c(-c3ccccc3)c(-c3ccc(O*)cc3)c(-c3ccccc3)c2-c2ccccc2)cc1": 64,
  "*Oc1ccc(-c2c(-c3ccccc3)c(-c3ccccc3)c(-c3ccccc3)c(-c3ccccc3)c2-c2ccc(O*)cc2)cc1": 65,
  "*Oc1ccc(-c2c(-c3ccccc3)cc(-c3ccccc3)c(-c3ccccc3)c2-c2ccc(O*)cc2)cc1": 66,
  "*Oc1ccc(-c2c(C#N)c(C#N)c(-c3ccc(O*)cc3)c3ccccc23)cc1": 67,
  "*Oc1ccc(-c2c3c(c(-c4ccc(O*)cc4)c4ccccc24)-c2nc4ccccc4n2C3=O)cc1": 68,
  "*Oc1ccc(-c2c3c(c(-c4ccc(O*)cc4)c4ccccc24)C(=O)N(c2cccc(P(=O)(O)O)c2)C3=O)cc1": 69,
  "*Oc1ccc(-c2c3c(c(-c4ccc(O*)cc4)c4ccccc24)C(=O)N(c2ccccc2)C3=O)cc1": 70,
  "*Oc1ccc(-c2c3c(c(-c4ccc(O*)cc4)c4ccccc24)C(=O)N(n2c(-c4ccccc4)nnc2-c2ccccc2)C3=O)cc1": 71,
  "*Oc1ccc(-c2c3c(c(-c4ccc(O*)cc4)c4ccccc24)C(=O)N(n2c(-c4ccccn4)nnc2-c2ccccn2)C3=O)cc1": 72,
  "*Oc1ccc(-c2c3c(c(-c4ccc(O*)cc4)c4ccccc24)C(=O)OC3=O)cc1": 73,
  "*Oc1ccc(-c2c3c(c(-c4ccc(O*)cc4)c4ccccc24)C2=Nc4cccc5cccc(c45)N2C3=O)cc1": 74,
  "*Oc1ccc(-c2c3ccccc3c(-c3ccc(O*)cc3)c3ccccc23)cc1": 75,
  "*Oc1ccc(-c2c3nc(c(-c4ccccc4)c4ccc([nH]4)c(-c4ccccc4)c4nc(c(-c5ccc(O*)cc5)c5ccc2[nH]5)C=C4)C=C3)cc1": 76,
  "*Oc1ccc(-c2cc(-c3ccc(C(F)(F)F)cc3)cc(-c3ccc(O*)cc3)n2)cc1": 77,
  "*Oc1ccc(-c2cc(-c3ccc(P(c4ccccc4)c4ccccc4)cc3)cc(-c3ccc(O*)cc3)n2)cc1": 78,
  "*Oc1ccc(-c2cc(-c3ccccc3)c(-c3ccc(O*)cc3)c(-c3ccccc3)c2-c2ccccc2)cc1": 79,
  "*Oc1ccc(-c2cc(-c3ccccc3)cc(-c3ccc(O*)cc3)c2)cc1": 80,
  "*Oc1ccc(-c2cc(-c3ccccc3)cc(-c3ccc(O*)cc3)n2)cc1": 81,
  "*Oc1ccc(-c2cc(-c3ccccc3)nc(-c3nc(-c4ccccc4)cc(-c4ccc(O*)cc4)n3)n2)cc1": 82,
  "*Oc1ccc(-c2ccc(-c3ccc(O*)cc3)c(C#N)c2C#N)cc1": 83,
  "*Oc1ccc(-c2ccc(-c3ccc(O*)cc3)c3c2C(=O)N(C)C3=O)cc1": 84,
  "*Oc1ccc(-c2ccc(-c3ccc(O*)cc3)c3c2C(=O)N(c2ccccc2)C3=O)cc1": 85,
  "*Oc1ccc(-c2ccc(-c3ccc(O*)cc3)cc2)cc1": 86,
  "*Oc1ccc(-c2ccc(-c3nn(*)c(=O)c4ccccc34)cc2)cc1": 87,
  "*Oc1ccc(-c2ccc(-c3nnc(-c4ccc(-c5ccc(O*)cc5)cc4)o3)cc2)cc1": 88,
  "*Oc1ccc(-c2ccc(=O)n(*)n2)cc1": 89,
  "*Oc1ccc(-c2ccc(=O)n(*)n2)cc1OC": 90,
  "*Oc1ccc(-c2ccc(Cc3ccc(-c4ccc(O*)cc4)cc3)cc2)cc1": 91,
  "*Oc1ccc(-c2ccc(N(c3ccc(/N=N/c4ccc([N+](=O)[O-])cc4)cc3)c3ccc(-c4ccc(O*)cc4)cc3)cc2)cc1": 92,
  "*Oc1ccc(-c2ccc(O*)c(CN(C)C)c2)cc1CN(C)C": 93,
  "*Oc1ccc(-c2ccc(O*)cc2)cc1": 94,
  "*Oc1ccc(-c2ccc(O*)cc2CCCCCCCCCCCCCCC)cc1": 95,
  "*Oc1ccc(-c2ccc(S(=O)(=O)c3ccc(-c4ccc(O*)cc4)cc3)cc2)cc1": 96,
  "*Oc1ccc(-c2ccc3c(c2)C2(c4ccccc4-c4ccccc42)c2cc(-c4ccc(O*)cc4)ccc2-3)cc1": 97,
  "*Oc1ccc(-c2ccc3c(c2)C2(c4ccccc4Oc4ccccc42)c2cc(-c4ccc(O*)cc4)ccc2-3)cc1": 98,
  "*Oc1ccc(-c2ccc3c(c2)c2cc(-c4ccc(O*)cc4)ccc2n3CCCCCC)cc1": 99,
  "*Oc1ccc(-c2ccc3c(c2)c2cc(-c4ccc(O*)cc4)ccc2n3CCCCCCCC)cc1": 100,
  "*Oc1ccc(-c2ccc3c(c2)c2cc(-c4ccc(O*)cc4)ccc2n3CCCCCCCCCCCC)cc1": 101,
  "*Oc1ccc(-c2cccc(-c3ccc(O*)cc3)c2)cc1": 102,
  "*Oc1ccc(-c2ccccc2-c2ccc(O*)cc2)cc1": 103,
  "*Oc1ccc(-c2nc(-c3ccc(O*)cc3)nc(N(c3ccccc3)c3ccccc3)n2)cc1": 104,
  "*Oc1ccc(-c2nc(-c3ccc(S(=O)(=O)c4ccccc4)cc3)oc2-c2ccc(O*)cc2)cc1": 105,
  "*Oc1ccc(-c2nc(-c3ccccc3)[nH]c2-c2ccc(O*)cc2)cc1": 106,
  "*Oc1ccc(-c2nc3cc(-c4ccc5nc(-c6ccc(O*)cc6)[nH]c5c4)ccc3[nH]2)cc1": 107,
  "*Oc1ccc(-c2nc3cc(C(=O)c4ccc5nc(-c6ccc(O*)cc6)[nH]c5c4)ccc3[nH]2)cc1": 108,
  "*Oc1ccc(-c2nc3cc(C(c4ccc5oc(-c6ccc(O*)cc6)nc5c4)(C(F)(F)F)C(F)(F)F)ccc3o2)cc1": 109,
  "*Oc1ccc(-c2nc3cc(Oc4ccc5nc(-c6ccc(O*)cc6)[nH]c5c4)ccc3[nH]2)cc1": 110,
  "*Oc1ccc(-c2nc3ccc(-c4ccc5nc(-c6ccc(O*)cc6)oc5c4)cc3o2)cc1": 111,
  "*Oc1ccc(-c2nc3ccccc3n2-c2ccc(-c3ccc(-n4c(-c5ccc(O*)cc5)nc5ccccc54)cc3)cc2)cc1": 112,
  "*Oc1ccc(-c2nc3ccccc3n2-c2ccc(-n3c(-c4ccc(O*)cc4)nc4ccccc43)cc2)cc1": 113,
  "*Oc1ccc(-c2nc3ccccc3nc2-c2ccc(O*)cc2)cc1": 114,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)c(C)c1": 115,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)c(C)c1C": 116,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)c(F)c1": 117,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)c2ccccc12": 118,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)cc1": 119,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)cc1-c1ccccc1": 120,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)cc1Br": 121,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)cc1C": 122,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)cc1C(C)C": 123,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)cc1CC": 124,
  "*Oc1ccc(-c2nn(*)c(=O)c3ccccc23)cc1Cl": 125,
  "*Oc1ccc(-c2nnc(-c3ccc(O*)cc3)c3cc4ccccc4cc23)cc1": 126,
  "*Oc1ccc(-c2nnc(-c3ccc(O*)cc3)n2-c2ccccc2)cc1": 127,
  "*Oc1ccc(-c2nnc(-c3ccc(O*)cc3)n2N2C(=O)c3ccc(C(C)(C)C)cc3C2=O)cc1": 128,
  "*Oc1ccc(-c2nnc(-c3ccc(O*)cc3)n2N2C(=O)c3ccccc3C2=O)cc1": 129,
  "*Oc1ccc(-c2nnc(-c3ccc(O*)cc3)o2)cc1": 130,
  "*Oc1ccc(-c2nnc(-c3ccccn3)nc2-c2ccc(O*)cc2)cc1": 131,
  "*Oc1ccc(-c2nnc(Sc3ccc(Oc4ccc(Sc5nnc(-c6ccc(O*)cc6)c6ccccc56)cc4)cc3)c3ccccc23)cc1": 132,
  "*Oc1ccc(-c2oc(-c3ccc(O*)cc3)c(-c3ccccc3)c2-c2ccccc2)cc1": 133,
  "*Oc1ccc(-c2sc(-c3ccc(O*)cc3)c(-c3ccccc3)c2-c2ccccc2)cc1": 134,
  "*Oc1ccc(/C(=C(\\c2ccccc2)c2ccc(O*)cc2)c2ccccc2)cc1": 135,
  "*Oc1ccc(/C(CC)=C(\\CC)c2ccc(O*)cc2)cc1": 136,
  "*Oc1ccc(/C=C/C=C/c2ccc(O*)cc2)cc1": 137,
  "*Oc1ccc(/C=C/c2cc(OCCCCCC)c(/C=C/c3ccc(O*)cc3)cc2OCCCCCC)cc1": 138,
  "*Oc1ccc(/C=C/c2ccc(O*)c(-c3ccccc3)c2)cc1": 139,
  "*Oc1ccc(/C=C/c2ccc(O*)c3ccccc23)cc1": 140,
  "*Oc1ccc(/C=C/c2ccc(O*)cc2)cc1": 141,
  "*Oc1ccc(C(=C)c2ccc(O*)cc2)cc1": 142,
  "*Oc1ccc(C(=O)C=Cc2cccc(C=CC(=O)c3ccc(O*)cc3)c2)cc1": 143,
  "*Oc1ccc(C(=O)c2cc(C(=O)c3ccc(O*)cc3)cc(C(C)(C)C)c2)cc1": 144,
  "*Oc1ccc(C(=O)c2ccc(C(=O)c3ccc(O*)cc3)cc2)cc1": 145,
  "*Oc1ccc(C(=O)c2ccc(O*)cc2)cc1": 146,
  "*Oc1ccc(C(C)(C)c2ccc(C(C)(C)c3ccc(O*)cc3)cc2)cc1": 147,
  "*Oc1ccc(C(C)(C)c2ccc(N3C(=O)c4ccc5c6c(ccc(c46)C3=O)C(=O)N(c3ccc(C(C)(C)c4ccc(O*)cc4)cc3)C5=O)cc2)cc1": 148,
  "*Oc1ccc(C(C)(C)c2ccc(N3C(=O)c4ccc5c6ccc7c8c(ccc(c9ccc(c4c59)C3=O)c86)C(=O)N(c3ccc(C(C)(C)c4ccc(O*)cc4)cc3)C7=O)cc2)cc1": 149,
  "*Oc1ccc(C(C)(C)c2ccc(O*)c(C)c2)cc1C": 150,
  "*Oc1ccc(C(C)(C)c2ccc(O*)cc2)cc1": 151,
  "*Oc1ccc(C(C)(C)c2ccc(Oc3ccc(-c4nc(C#N)c(C#N)nc4-c4ccc(Oc5ccc(C(C)(C)c6ccc(O*)cc6)cc5)cc4)cc3)cc2)cc1": 152,
  "*Oc1ccc(C(C)(C)c2cccc(O*)c2)cc1": 153,
  "*Oc1ccc(C(C)(CC)c2ccc(O*)cc2)cc1": 154,
  "*Oc1ccc(C(C)(CCC(=O)O)c2ccc(O*)cc2)cc1": 155,
  "*Oc1ccc(C(C)(CCCC)c2ccc(O*)cc2)cc1": 156,
  "*Oc1ccc(C(C)(CCCP(=O)(OCC)OCC)c2ccc(O*)cc2)cc1": 157,
  "*Oc1ccc(C(C)(c2ccc(CCCCCCCCCCCCCCC)cc2)c2ccc(O*)cc2)cc1": 158,
  "*Oc1ccc(C(C)(c2ccccc2)c2ccc(O*)cc2)cc1": 159,
  "*Oc1ccc(C(CC)(CC)c2ccc(O*)cc2)cc1": 160,
  "*Oc1ccc(C(CCCCC)(CCCCC)c2ccc(O*)cc2)cc1": 161,
  "*Oc1ccc(C(CCCCCCC)(CCCCCCC)c2ccc(O*)cc2)cc1": 162,
  "*Oc1ccc(C(CCCCCCCCCCC)(CCCCCCCCCCC)c2ccc(O*)cc2)cc1": 163,
  "*Oc1ccc(C(c2ccc(Br)cc2)(c2ccc(O*)cc2)C(F)(F)F)cc1": 164,
  "*Oc1ccc(C(c2ccc(C#C)cc2)(c2ccc(O*)cc2)C(F)(F)F)cc1": 165,
  "*Oc1ccc(C(c2ccc(C#Cc3ccccc3)cc2)(c2ccc(O*)cc2)C(F)(F)F)cc1": 166,
  "*Oc1ccc(C(c2ccc(N)cc2)(c2ccc(O*)cc2)P2(=O)Oc3ccccc3-c3ccccc32)cc1": 167,
  "*Oc1ccc(C(c2ccc(O*)c(C)c2)c2ccccc2C(=O)O)cc1C": 168,
  "*Oc1ccc(C(c2ccc(O*)c(N)c2)(C(F)(F)F)C(F)(F)F)cc1N": 169,
  "*Oc1ccc(C(c2ccc(O*)c(NC(=O)c3ccc4nc[nH]c4c3)c2)(C(F)(F)F)C(F)(F)F)cc1NC(=O)c1ccc2[nH]cnc2c1": 170,
  "*Oc1ccc(C(c2ccc(O*)cc2)(C(F)(F)F)C(F)(F)F)cc1": 171,
  "*Oc1ccc(C(c2ccc(O*)cc2)(P2(=O)Oc3ccccc3-c3ccccc32)P2(=O)Oc3ccccc3-c3ccccc32)cc1": 172,
  "*Oc1ccc(C(c2ccc(O*)cc2)(c2ccc(Sc3ccc(F)cc3)cc2)C(F)(F)F)cc1": 173,
  "*Oc1ccc(C(c2ccc(O*)cc2)C(C)(C)C)cc1": 174,
  "*Oc1ccc(C(c2ccc(O*)cc2)c2ccccc2C(=O)O)cc1": 175,
  "*Oc1ccc(C(c2ccccc2)(c2ccc(O*)cc2)C(F)(F)F)cc1": 176,
  "*Oc1ccc(C(c2ccccc2)(c2ccc(O*)cc2)c2ccc(Oc3ccccc3)cc2)cc1": 177,
  "*Oc1ccc(C(c2ccccc2)(c2ccccc2)c2ccc(O*)cc2)cc1": 178,
  "*Oc1ccc(C(c2ccccc2)(c2ccccc2)c2ccc(Oc3ccc(S(=O)(=O)c4ccc(Oc5ccc(C(c6ccccc6)(c6ccccc6)c6ccc(O*)cc6)cc5)cc4)cc3)cc2)cc1": 179,
  "*Oc1ccc(C(c2ccccc2)(c2ccccc2)c2ccc(Oc3ccc(S(=O)(=O)c4ccc(Oc5ccc(C(c6ccccc6)(c6ccccc6)c6ccc(Oc7ccc(S(=O)(=O)c8ccc(Oc9ccc(C(c%10ccccc%10)(c%10ccccc%10)c%10ccc(O*)cc%10)cc9)cc8)cc7)cc6)cc5)cc4)cc3)cc2)cc1": 180,
  "*Oc1ccc(C(c2ccccc2)c2ccc(O*)cc2)cc1": 181,
  "*Oc1ccc(C(c2ccccc2C(=O)O)c2ccc(O*)c3ccccc23)c2ccccc12": 182,
  "*Oc1ccc(C(c2ccncc2)(c2ccc(C)cc2)c2ccc(O*)cc2)cc1": 183,
  "*Oc1ccc(C2(C)CC(C)(C)c3ccc(O*)cc32)cc1": 184,
  "*Oc1ccc(C2(c3ccc(O*)c(C(C)(C)C)c3)c3ccccc3-c3ccccc32)cc1C(C)(C)C": 185,
  "*Oc1ccc(C2(c3ccc(O*)c(C(C)C)c3)OC(=O)c3ccccc32)cc1C(C)C": 186,
  "*Oc1ccc(C2(c3ccc(O*)c(C(C)C)c3)c3ccccc3-c3ccccc32)cc1C(C)C": 187,
  "*Oc1ccc(C2(c3ccc(O*)c(C)c3)CCC3CCCCC3C2)cc1C": 188,
  "*Oc1ccc(C2(c3ccc(O*)c(C)c3)OC(=O)c3ccccc32)cc1C": 189,
  "*Oc1ccc(C2(c3ccc(O*)c(C)c3)c3ccccc3-c3ccccc32)cc1C": 190,
  "*Oc1ccc(C2(c3ccc(O*)c(C)c3)c3ccccc3Oc3ccccc32)cc1C": 191,
  "*Oc1ccc(C2(c3ccc(O*)c(OC)c3)CCCCC2)cc1OC": 192,
  "*Oc1ccc(C2(c3ccc(O*)cc3)C3CC4CC(C3)CC2C4)cc1": 193,
  "*Oc1ccc(C2(c3ccc(O*)cc3)CC(C)CC(C)(C)C2)cc1": 194,
  "*Oc1ccc(C2(c3ccc(O*)cc3)CC3CC2C2CCCC32)cc1": 195,
  "*Oc1ccc(C2(c3ccc(O*)cc3)CCC3CCCCC3C2)cc1": 196,
  "*Oc1ccc(C2(c3ccc(O*)cc3)CCCC(CCCCCCCCCCCCCCC)C2)cc1": 197,
  "*Oc1ccc(C2(c3ccc(O*)cc3)CCCCC2)cc1": 198,
  "*Oc1ccc(C2(c3ccc(O*)cc3)CCCCCCCCCCC2)cc1": 199,
  "*Oc1ccc(C2(c3ccc(O*)cc3)NC(=O)c3ccccc32)cc1": 200,
  "*Oc1ccc(C2(c3ccc(O*)cc3)OC(=O)c3ccccc32)cc1": 201,
  "*Oc1ccc(C2(c3ccc(O*)cc3)c3ccccc3-c3c(C(=O)O)cccc32)cc1": 202,
  "*Oc1ccc(C2(c3ccc(O*)cc3)c3ccccc3-c3ccccc32)cc1": 203,
  "*Oc1ccc(C2(c3ccc(O*)cc3)c3ccccc3C(=O)N2C)cc1": 204,
  "*Oc1ccc(C2(c3ccc(O*)cc3)c3ccccc3C(=O)N2c2ccc(C(C)(C)C)cc2)cc1": 205,
  "*Oc1ccc(C2(c3ccc(O*)cc3)c3ccccc3C(=O)N2c2ccccc2)cc1": 206,
  "*Oc1ccc(C2(c3ccc(O*)cc3)c3ccccc3Oc3ccccc32)cc1": 207,
  "*Oc1ccc(C2(c3ccc(O*)cc3)c3cccnc3-c3ncccc32)cc1": 208,
  "*Oc1ccc(C23CC4CC(C2)CC(c2ccc(O*)cc2)(C4)C3)cc1": 209,
  "*Oc1ccc(C23CC4CC(CC(C4)C2)C3)c(O*)c1": 210,
  "*Oc1ccc(C23CC4CC(CC(C4)C2)C3)c2c(O*)ccc(C34CC5CC(CC(C5)C3)C4)c12": 211,
  "*Oc1ccc(C2CCC(c3ccc(O*)cc3)CC2)cc1": 212,
  "*Oc1ccc(C=CC(=O)c2ccc(O*)cc2)cc1": 213,
  "*Oc1ccc(CC(=O)c2ccc(O*)cc2)cc1": 214,
  "*Oc1ccc(C[C@H]2CC[C@H](Cc3ccc(O*)cc3)CC2)cc1": 215,
  "*Oc1ccc(Cc2ccc(O*)c(C=O)c2)cc1C=O": 216,
  "*Oc1ccc(Cc2ccc(O*)c(CNc3cccnc3)c2)cc1CNc1cccnc1": 217,
  "*Oc1ccc(Cc2ccc(O*)cc2)cc1": 218,
  "*Oc1ccc(N(c2ccc(/C=C/c3ccc(C(C#N)=C(C#N)C#N)s3)cc2)c2ccc(O*)cc2)cc1": 219,
  "*Oc1ccc(N(c2ccc(/C=C/c3cccs3)cc2)c2ccc(O*)cc2)cc1": 220,
  "*Oc1ccc(N(c2ccc(C)cc2)c2ccc(-c3ccc(N(c4ccc(C)cc4)c4ccc(O*)cc4)cc3)cc2)cc1": 221,
  "*Oc1ccc(N(c2ccc(CC)cc2)c2ccc(-c3ccc(N(c4ccc(CC)cc4)c4ccc(O*)cc4)cc3)cc2)cc1": 222,
  "*Oc1ccc(N(c2ccccc2)c2ccc(-c3ccc(N(c4ccccc4)c4ccc(O*)cc4)cc3)cc2)cc1": 223,
  "*Oc1ccc(N=Nc2ccc(C(=O)c3ccc(N=Nc4ccc(O*)cc4)cc3)cc2)cc1": 224,
  "*Oc1ccc(N=Nc2ccc(N=Nc3ccc(O*)cc3)cc2)cc1": 225,
  "*Oc1ccc(N=Nc2ccc(Oc3ccc(N=Nc4ccc(O*)cc4)cc3)cc2)cc1": 226,
  "*Oc1ccc(N=Nc2ccc(S(=O)(=O)c3ccc(N=Nc4ccc(O*)cc4)cc3)cc2)cc1": 227,
  "*Oc1ccc(NC(=O)c2ccc(C(=O)Nc3ccc(O*)cc3)cc2)cc1": 228,
  "*Oc1ccc(O*)c(-c2cc(C(F)(F)F)cc(C(F)(F)F)c2)c1": 229,
  "*Oc1ccc(O*)c(-c2cc(C)cc(C)c2)c1": 230,
  "*Oc1ccc(O*)c(-c2cc3ccc2Oc2ccc(cc2)C(=O)c2ccc(cc2)Oc2ccc(cc2)Oc2ccc(cc2)C(=O)c2ccc(cc2)O3)c1": 231,
  "*Oc1ccc(O*)c(-c2ccc(-c3ccc4ccc5cccc6ccc3c4c56)cc2)c1": 232,
  "*Oc1ccc(O*)c(-c2ccc(-c3ccccc3)cc2)c1": 233,
  "*Oc1ccc(O*)c(-c2ccc(Br)cc2)c1": 234,
  "*Oc1ccc(O*)c(-c2ccc(C#Cc3ccccc3)cc2)c1": 235,
  "*Oc1ccc(O*)c(-c2ccc(C#N)c(C#N)c2)c1": 236,
  "*Oc1ccc(O*)c(-c2ccc(C#N)cc2)c1": 237,
  "*Oc1ccc(O*)c(-c2ccc(C(=O)OCC)cc2)c1": 238,
  "*Oc1ccc(O*)c(-c2ccc(C34CC5CC(CC(C5)C3)C4)cc2)c1": 239,
  "*Oc1ccc(O*)c(-c2ccc(CC)cc2)c1": 240,
  "*Oc1ccc(O*)c(-c2ccc(CCC)cc2)c1": 241,
  "*Oc1ccc(O*)c(-c2ccc(CCCC)cc2)c1": 242,
  "*Oc1ccc(O*)c(-c2ccc(Cl)c(C(F)(F)F)c2)c1": 243,
  "*Oc1ccc(O*)c(-c2ccc(F)c(F)c2)c1": 244,
  "*Oc1ccc(O*)c(-c2ccc(F)cc2)c1": 245,
  "*Oc1ccc(O*)c(-c2ccc(I)cc2)c1": 246,
  "*Oc1ccc(O*)c(-c2ccc(N)cc2)c1": 247,
  "*Oc1ccc(O*)c(-c2ccc(OC)cc2)c1": 248,
  "*Oc1ccc(O*)c(-c2ccc(Oc3ccc(C(F)(F)F)cc3)cc2)c1": 249,
  "*Oc1ccc(O*)c(-c2ccc(Oc3ccccc3)cc2)c1": 250,
  "*Oc1ccc(O*)c(-c2cccc(C(F)(F)F)c2)c1": 251,
  "*Oc1ccc(O*)c(-c2cccc(C)c2)c1": 252,
  "*Oc1ccc(O*)c(-c2cccc(OC)c2)c1": 253,
  "*Oc1ccc(O*)c(-c2ccccc2)c1": 254,
  "*Oc1ccc(O*)c(-c2ccncc2)c1": 255,
  "*Oc1ccc(O*)c(C(=O)c2ccc(C#Cc3ccccc3)cc2)c1": 256,
  "*Oc1ccc(O*)c(C(C)(C)C)c1": 257,
  "*Oc1ccc(O*)c(C)c1": 258,
  "*Oc1ccc(O*)c(Cl)c1": 259,
  "*Oc1ccc(O*)c(OC)c1": 260,
  "*Oc1ccc(O*)c(P(=O)(c2ccccc2)c2ccccc2)c1": 261,
  "*Oc1ccc(O*)c(P2(=O)Oc3ccccc3-c3ccccc32)c1": 262,
  "*Oc1ccc(O*)c2ccccc12": 263,
  "*Oc1ccc(O*)cc1": 264,
  "*Oc1ccc(Oc2c(F)c(F)c(Oc3ccc(O*)c(C(C)=O)c3)c(F)c2F)cc1C(C)=O": 265,
  "*Oc1ccc(Oc2c(F)c(F)c(Oc3ccc(O*)c(CC=C)c3)c(F)c2F)cc1CC=C": 266,
  "*Oc1ccc(Oc2c(F)c(F)c(Oc3ccc(O*)cc3)c(F)c2F)cc1": 267,
  "*Oc1ccc(Oc2c(Oc3cc(C)cc(C)c3)c(Oc3cc(C)cc(C)c3)c(Oc3ccc(O*)cc3)c(Oc3cc(C)cc(C)c3)c2Oc2cc(C)cc(C)c2)cc1": 268,
  "*Oc1ccc(Oc2cc(Oc3ccc(O*)cc3)cc(C(=O)c3ccccc3)c2)cc1": 269,
  "*Oc1ccc(Oc2ccc(C(=O)c3ccc(Oc4ccc(O*)cc4)cc3)cc2)cc1": 270,
  "*Oc1ccc(Oc2ccc(O*)cc2)cc1": 271,
  "*Oc1ccc(Oc2ccc(Oc3ccc(O*)cc3)cc2)cc1": 272,
  "*Oc1ccc(Oc2ccc(P(=O)(c3ccccc3)c3ccc(Oc4ccc(O*)cc4)cc3)cc2)cc1": 273,
  "*Oc1ccc(Oc2ccc(S(=O)(=O)c3ccc(Oc4ccc(O*)cc4)cc3)cc2)cc1": 274,
  "*Oc1ccc(Oc2cccc(Oc3ccc(O*)cc3)c2)cc1": 275,
  "*Oc1ccc(Oc2ccccc2-c2ccccc2Oc2ccc(O*)cc2)cc1": 276,
  "*Oc1ccc(P(=O)(c2ccc(O*)cc2)c2ccc(-n3c4ccc(C(C)(C)C)cc4c4cc(C(C)(C)C)ccc43)cc2)cc1": 277,
  "*Oc1ccc(P(=O)(c2ccc(O*)cc2)c2ccc(C(F)(F)F)cc2)cc1": 278,
  "*Oc1ccc(P(=O)(c2ccccc2)c2ccc(O*)cc2)cc1": 279,
  "*Oc1ccc(S(=O)(=O)c2ccc(O*)cc2)cc1": 280,
  "*Oc1ccc(S(=O)(=O)c2ccc(O*)cc2C(F)(F)F)c(C(F)(F)F)c1": 281,
  "*Oc1ccc(S(=O)(=O)c2ccccc2O*)cc1": 282,
  "*Oc1ccc(Sc2ccc(-c3ccc(O*)cc3)nn2)cc1": 283,
  "*Oc1ccc(Sc2ccc(O*)cc2)cc1": 284,
  "*Oc1ccc(Sc2nnc(-c3ccc(O*)cc3)c3ccccc23)cc1": 285,
  "*Oc1ccc2c(C(=O)c3cc(C(F)(F)F)cc(C(F)(F)F)c3)c(O*)ccc2c1": 286,
  "*Oc1ccc2c(C(=O)c3ccc(C)cc3)c(O*)ccc2c1C(=O)c1ccc(C)cc1": 287,
  "*Oc1ccc2c(C(=O)c3cccc(C(F)(F)F)c3)c(O*)ccc2c1": 288,
  "*Oc1ccc2c(C(=O)c3cccc(C(F)(F)F)c3)c(O*)ccc2c1C(=O)c1cccc(C(F)(F)F)c1": 289,
  "*Oc1ccc2c(C(=O)c3cccc(C)c3)c(O*)ccc2c1C(=O)c1cccc(C)c1": 290,
  "*Oc1ccc2c(C(=O)c3ccccc3)c(O*)ccc2c1C(=O)c1ccccc1": 291,
  "*Oc1ccc2c(O*)cccc2c1": 292,
  "*Oc1ccc2c(c1)OCCOCCOc1ccc(O*)cc1OCCOCCO2": 293,
  "*Oc1ccc2c(c1)Oc1cc(O*)ccc1C21OC(=O)c2ccccc21": 294,
  "*Oc1ccc2c3ccc(O*)cc3n(CCCCCCC#N)c2c1": 295,
  "*Oc1ccc2c3ccc(O*)cc3n(CCCCCCCC)c2c1": 296,
  "*Oc1ccc2c3ccc(O*)cc3n(CCCCCCn3c4ccccc4c4ccccc43)c2c1": 297,
  "*Oc1ccc2cc(N(c3ccccc3)c3ccc(-c4ccc(N(c5ccccc5)c5ccc6cc(O*)ccc6c5)cc4)cc3)ccc2c1": 298,
  "*Oc1ccc2cc(O*)ccc2c1": 299,
  "*Oc1ccc2ccc(O*)cc2c1": 300,
  "*Oc1ccc2ccccc2c1-c1c(O*)ccc2ccccc12": 301,
  "*Oc1cccc(-c2cccc(O*)c2)c1": 302,
  "*Oc1cccc(-c2nc3ccccc3nc2-c2cccc(O*)c2)c1": 303,
  "*Oc1cccc(-c2nnc(-c3cccc(O*)c3)n2-c2cccc(C(F)(F)F)c2)c1": 304,
  "*Oc1cccc(-c2nnc(-c3cccc(O*)c3)o2)c1": 305,
  "*Oc1cccc(C(c2cccc(O*)c2)(C(F)(F)F)C(F)(F)F)c1": 306,
  "*Oc1cccc(Cc2cccc(O*)c2)c1": 307,
  "*Oc1cccc(O*)c1": 308,
  "*Oc1cccc(O*)c1Oc1ccc(C(=O)c2c3ccccc3cc3ccccc23)cc1": 309,
  "*Oc1cccc(Oc2c(F)c(F)c(-c3c(F)c(F)c(Oc4cccc(O*)c4)c(F)c3F)c(F)c2F)c1": 310,
  "*Oc1cccc(Oc2c(F)c(F)c(Oc3cccc(O*)c3)c(F)c2F)c1": 311,
  "*Oc1cccc2c(O*)cccc12": 312,
  "*Oc1cccc2c(O*)nccc12": 313,
  "*Oc1cccc2c1ccn2*": 314,
  "*Oc1ccccc1-c1ccccc1-c1ccc(-c2ccc(-c3ccccc3-c3ccccc3O*)cc2)cc1": 315,
  "*Oc1ccccc1-c1ccccc1O*": 316,
  "*Oc1ccccc1-c1nc2ccccc2n1*": 317,
  "*Oc1ccccc1O*": 318,
  "*c1c(-c2ccccc2)cnc2c1ccc1c(*)c(-c3ccccc3)cnc12": 319,
  "*c1c(F)c(F)c(-c2c(F)c(F)c(*)c(F)c2F)c(F)c1F": 320,
  "*c1c(F)c(F)c(-c2c(F)c(F)c(Oc3cccc(Oc4c(F)c(F)c(-c5c(F)c(F)c(*)c(F)c5F)c(F)c4F)c3)c(F)c2F)c(F)c1F": 321,
  "*c1c(F)c(F)c(-c2nnc(-c3c(F)c(F)c(*)c(F)c3F)o2)c(F)c1F": 322,
  "*c1c(F)c(F)c(C(=O)Nc2ccc(NC(=O)c3c(F)c(F)c(*)c(F)c3F)cc2)c(F)c1F": 323,
  "*c1c(F)c(F)c(C(=O)Nc2ccc(Oc3ccc(NC(=O)c4c(F)c(F)c(*)c(F)c4F)cc3)cc2)c(F)c1F": 324,
  "*c1c(F)c(F)c(C(=O)Nc2cccc(NC(=O)c3c(F)c(F)c(*)c(F)c3F)c2)c(F)c1F": 325,
  "*c1c(F)c(F)c(C(=O)c2c(F)c(F)c(*)c(F)c2F)c(F)c1F": 326,
  "*c1c(F)c(F)c(C(=O)c2ccc(Oc3ccc(C(=O)c4c(F)c(F)c(*)c(F)c4F)cc3)cc2)c(F)c1F": 327,
  "*c1c(F)c(F)c(C(=O)c2ccc(Sc3ccc(C(=O)c4c(F)c(F)c(*)c(F)c4F)cc3)cc2)c(F)c1F": 328,
  "*c1c(F)c(F)c(C=CC(=O)c2c(F)c(F)c(*)c(F)c2F)c(F)c1F": 329,
  "*c1c(F)c(F)c(S(=O)(=O)c2c(F)c(F)c(*)c(F)c2F)c(F)c1F": 330,
  "*c1c(F)c(F)c(Sc2c(F)c(F)c(*)c(F)c2F)c(F)c1F": 331,
  "*c1c(F)c(Oc2ccccc2)c(F)c(*)c1C#N": 332,
  "*c1cc(*)cc(C(=O)c2ccccc2)c1": 333,
  "*c1cc(*)cc(P(=O)(c2ccccc2)c2ccccc2)c1": 334,
  "*c1cc(*)cc(S(=O)(=O)N(C(C)C)C(C)C)c1": 335,
  "*c1cc(*)cc(S(=O)(=O)N(C)c2ccccc2)c1": 336,
  "*c1cc(*)cc(S(=O)(=O)N(C2CCCCC2)C2CCCCC2)c1": 337,
  "*c1cc(*)cc(S(=O)(=O)N(CC(CC)CCCC)CC(CC)CCCC)c1": 338,
  "*c1cc(*)cc(S(=O)(=O)N(CC)CC)c1": 339,
  "*c1cc(*)cc(S(=O)(=O)N(CC)c2ccccc2)c1": 340,
  "*c1cc(*)cc(S(=O)(=O)N(CC=C)CCN(CC)CC)c1": 341,
  "*c1cc(*)cc(S(=O)(=O)N(CCC)CCC)c1": 342,
  "*c1cc(*)cc(S(=O)(=O)N(CCC)c2ccccc2)c1": 343,
  "*c1cc(*)cc(S(=O)(=O)N(CCCC)CCCC)c1": 344,
  "*c1cc(*)cc(S(=O)(=O)N(CCCC)c2ccccc2)c1": 345,
  "*c1cc(*)cc(S(=O)(=O)N(CCCCC)c2ccccc2)c1": 346,
  "*c1cc(*)cc(S(=O)(=O)N(CCCCCC)CCCCCC)c1": 347,
  "*c1cc(*)cc(S(=O)(=O)N(CCCCCC)c2ccccc2)c1": 348,
  "*c1cc(*)cc(S(=O)(=O)N(CCCCCCC)c2ccccc2)c1": 349,
  "*c1cc(*)cc(S(=O)(=O)N(CCCCCCCC)CCCCCCCC)c1": 350,
  "*c1cc(*)cc(S(=O)(=O)N(CCCCCCCC)c2ccccc2)c1": 351,
  "*c1cc(*)cc(S(=O)(=O)N(CCCCCCCCCCC)c2ccccc2)c1": 352,
  "*c1cc(*)cc(S(=O)(=O)N(CCCCCCCCCCCC)c2ccccc2)c1": 353,
  "*c1cc(*)cc(S(=O)(=O)c2cccc(I)c2)c1": 354,
  "*c1cc(*)cc(S(=O)(=O)c2ccccc2)c1": 355,
  "*c1cc(-c2nc3ccccc3[nH]2)c(*)cc1-c1nc2ccccc2[nH]1": 356,
  "*c1cc(-c2nc3ccccc3o2)c(*)cc1-c1nc2ccccc2o1": 357,
  "*c1cc(C(=O)c2ccc(C(C)C)cc2)c(*)cc1C(=O)c1ccc(C(C)C)cc1": 358,
  "*c1cc(C(=O)c2ccccc2)c(*)cc1C(=O)c1ccccc1": 359,
  "*c1cc(C)nc2c1ccc1c(*)cc(C)nc12": 360,
  "*c1ccc(*)c(S(=O)(=O)N(CC=C)CCN(CC)CC)c1": 361,
  "*c1ccc(-c2c3ccccc3c(-c3ccc(*)c(C(F)(F)F)c3)c3ccccc23)cc1C(F)(F)F": 362,
  "*c1ccc(-c2cc(-c3ccc(*)cc3)ncn2)cc1": 363,
  "*c1ccc(-c2cc(-c3ccccc3)nc(-c3ccc(*)cc3)n2)cc1": 364,
  "*c1ccc(-c2ccc(*)c(C(F)(F)F)c2)cc1C(F)(F)F": 365,
  "*c1ccc(-c2ccc(-c3c(-c4ccccc4)c(-c4ccccc4)c(-c4ccc(-c5ccc(*)c(C(F)(F)F)c5)cc4)c(-c4ccccc4)c3-c3ccccc3)cc2)cc1C(F)(F)F": 366,
  "*c1ccc(-c2ccc(-c3cc(-c4ccccc4)c(-c4ccc(-c5ccc(*)c(C(F)(F)F)c5)cc4)c(-c4ccccc4)c3-c3ccccc3)cc2)cc1C(F)(F)F": 367,
  "*c1ccc(-c2ccc(-c3ccc(*)c(C(F)(F)F)c3)c(C(F)(F)F)c2)cc1C(F)(F)F": 368,
  "*c1ccc(-c2ccc(-c3ccc(*)c(C(F)(F)F)c3)cc2)cc1C(F)(F)F": 369,
  "*c1ccc(-c2ccc(-c3ccc(*)c(C(F)(F)F)c3)s2)cc1C(F)(F)F": 370,
  "*c1ccc(-c2ccc(-c3ccc(*)cc3)nn2)cc1": 371,
  "*c1ccc(-c2ccc(-c3ccc(-c4ccc(*)c(C(F)(F)F)c4)cc3)cc2)cc1C(F)(F)F": 372,
  "*c1ccc(-c2ccc(-c3ccc(-c4ccc(-c5ccc(*)c(C(F)(F)F)c5)cc4)c(-c4ccccc4)c3-c3ccccc3)cc2)cc1C(F)(F)F": 373,
  "*c1ccc(-c2ccc(S(=O)(=O)c3ccc(-c4ccc(*)cc4)cc3)cc2)cc1": 374,
  "*c1ccc(-c2ccc3c(c2)C(CC(CC)CCCC)(CC(CC)CCCC)c2cc(-c4ccc(*)c(C(F)(F)F)c4)ccc2-3)cc1C(F)(F)F": 375,
  "*c1ccc(-c2ccc3c(c2)C(c2ccccc2)(c2ccccc2)c2cc(-c4ccc(*)c(C(F)(F)F)c4)ccc2-3)cc1C(F)(F)F": 376,
  "*c1ccc(-c2ccc3c(c2)C2(c4cc(-c5ccc(*)c(C(F)(F)F)c5)ccc4-3)C3CC4CC(C3)CC2C4)cc1C(F)(F)F": 377,
  "*c1ccc(-c2ccc3c(c2)C2(c4ccccc4-c4ccccc42)c2cc(-c4ccc(*)c(C(F)(F)F)c4)ccc2-3)cc1C(F)(F)F": 378,
  "*c1ccc(-c2ccc3c(c2)C2(c4ccccc4Oc4ccccc42)c2cc(-c4ccc(*)c(C(F)(F)F)c4)ccc2-3)cc1C(F)(F)F": 379,
  "*c1ccc(-c2ccc3c(c2)Cc2cc(-c4ccc(*)c(C(F)(F)F)c4)ccc2-3)cc1C(F)(F)F": 380,
  "*c1ccc(-c2cccc(-c3ccc(*)c(C(F)(F)F)c3)c2)cc1C(F)(F)F": 381,
  "*c1ccc(-c2cccc(-c3ccc(*)c(C(F)(F)F)c3)n2)cc1C(F)(F)F": 382,
  "*c1ccc(-c2cnc(-c3ccc(*)c(C(F)(F)F)c3)o2)cc1": 383,
  "*c1ccc(-c2cnc(-c3ccc(*)c(C(F)(F)F)c3)o2)cc1C(F)(F)F": 384,
  "*c1ccc(-c2cnc(-c3ccc(*)cc3)o2)cc1": 385,
  "*c1ccc(-c2nc(-c3ccc(*)cc3)nc(-c3ccc(C(F)(F)F)cc3)n2)cc1": 386,
  "*c1ccc(-c2nc(-c3ccc(*)cc3)nc(-c3cccc4ccccc34)n2)cc1": 387,
  "*c1ccc(-c2nc(-c3ccc(*)cc3)nc(-c3ccnc4ccccc34)n2)cc1": 388,
  "*c1ccc(-c2nc(-c3ccccc3)c(-c3ccc(*)cc3)c3c(-c4ccccc4)c(-c4ccccc4)c(-c4ccccc4)c(-c4ccccc4)c23)cc1": 389,
  "*c1ccc(-c2nc(-c3ccccc3)c(-c3ccc(*)cc3)c3c(-c4ccccc4)ccc(-c4ccccc4)c23)cc1": 390,
  "*c1ccc(-c2nc(-c3ccccc3)c(-c3ccc(*)cc3)c3ccccc23)cc1": 391,
  "*c1ccc(-c2nc(-c3ccccc3)nc(-c3ccc(*)cc3)n2)cc1": 392,
  "*c1ccc(-c2nc(-c3ccncc3)nc(-c3ccc(*)cc3)n2)cc1": 393,
  "*c1ccc(-c2nc3cc(-c4ccc5nc(-c6ccc(*)cc6)[nH]c5c4)ccc3[nH]2)cc1": 394,
  "*c1ccc(-c2nc3cc(-c4ccc5oc(-c6ccc(*)cc6)nc5c4)ccc3o2)cc1": 395,
  "*c1ccc(-c2nc3cc(C(c4ccc5oc(-c6ccc(*)cc6)nc5c4)(C(F)(F)F)C(F)(F)F)ccc3o2)cc1": 396,
  "*c1ccc(-c2nc3cc4nc(-c5ccc(*)cc5)oc4cc3o2)cc1": 397,
  "*c1ccc(-c2nc3cc4sc(-c5ccc(*)cc5)nc4cc3s2)cc1": 398,
  "*c1ccc(-c2nc3ccc(-c4ccc5nc(-c6ccc(*)cc6)oc5c4)cc3o2)cc1": 399,
  "*c1ccc(-c2nc3ccc(C(=O)c4ccccc4)cc3nc2-c2ccc(*)cc2)cc1": 400,
  "*c1ccc(-c2nc3ccc(C(F)(F)F)cc3nc2-c2ccc(*)cc2)cc1": 401,
  "*c1ccc(-c2nc3ccc(C(c4ccc5nc(-c6ccc(*)cc6)oc5c4)(C(F)(F)F)C(F)(F)F)cc3o2)cc1": 402,
  "*c1ccc(-c2nc3ccc(S(=O)(=O)c4ccccc4)cc3nc2-c2ccc(*)cc2)cc1": 403,
  "*c1ccc(-c2nc3ccccc3nc2-c2ccc(*)cc2)cc1": 404,
  "*c1ccc(-c2nc3cccnc3nc2-c2ccc(*)cc2)cc1": 405,
  "*c1ccc(-c2ncc(-c3ccc(*)c(C(F)(F)F)c3)o2)cc1": 406,
  "*c1ccc(-c2nnc(-c3ccc(*)cc3)n2-c2ccc(N(c3ccccc3)c3ccccc3)cc2)cc1": 407,
  "*c1ccc(-c2nnc(-c3ccc(*)cc3)o2)cc1": 408,
  "*c1ccc(-c2nnc(-c3ccc(*)cc3)s2)cc1": 409,
  "*c1ccc(-c2nnc(-c3ccc(-c4ccc(-c5nnc(-c6ccc(*)cc6)o5)cc4)cc3)o2)cc1": 410,
  "*c1ccc(-c2nnc(-c3ccc(Oc4ccc(-c5nnc(-c6ccc(*)cc6)o5)cc4)cc3)o2)cc1": 411,
  "*c1ccc(-c2nnc(-c3ccccn3)nc2-c2ccc(*)cc2)cc1": 412,
  "*c1ccc(/C(=N/c2ccccc2)c2ccc(-c3ccc(/C(=N/c4ccccc4)c4ccc(*)cc4)cc3)cc2)cc1": 413,
  "*c1ccc(/C2=N/c3ccccc3/C(c3ccc(*)cc3)=N\\c3ccccc32)cc1": 414,
  "*c1ccc(/C=C/C(=O)c2ccc(*)cc2)cc1": 415,
  "*c1ccc(C#Cc2ccc(*)cc2)cc1": 416,
  "*c1ccc(C#Cc2ccccc2*)cc1": 417,
  "*c1ccc(C#N)c(*)c1": 418,
  "*c1ccc(C(=C)c2ccc(*)cc2)cc1": 419,
  "*c1ccc(C(=Nc2ccc(N=C(c3ccccc3)c3ccc(*)cc3)cc2)c2ccccc2)cc1": 420,
  "*c1ccc(C(=Nc2ccc(Oc3ccc(N=C(c4ccccc4)c4ccc(*)cc4)cc3)cc2)c2ccccc2)cc1": 421,
  "*c1ccc(C(=Nc2ccccc2)c2ccc(*)cc2)cc1": 422,
  "*c1ccc(C(=Nc2ccccc2)c2ccc(C(=Nc3ccccc3)c3ccc(*)cc3)cc2)cc1": 423,
  "*c1ccc(C(=Nc2ccccc2)c2ccc(S(=O)(=O)c3ccc(C(=Nc4ccccc4)c4ccc(*)cc4)cc3)cc2)cc1": 424,
  "*c1ccc(C(=O)C(=O)c2ccc(*)cc2)cc1": 425,
  "*c1ccc(C(=O)C2CC=C(C)CC2C(=O)c2ccc(*)cc2)cc1": 426,
  "*c1ccc(C(=O)Nc2ccc(-c3ccc(NC(=O)c4ccc(*)cc4)cc3C(F)(F)F)c(C(F)(F)F)c2)cc1": 427,
  "*c1ccc(C(=O)Nc2ccc(NC(=O)c3ccc(*)cc3)cc2)cc1": 428,
  "*c1ccc(C(=O)Nc2ccc(Oc3ccc(NC(=O)c4ccc(*)cc4)cc3)cc2)cc1": 429,
  "*c1ccc(C(=O)Nc2ccc(Oc3ccc(Oc4ccc(NC(=O)c5ccc(*)cc5)cc4)cc3)cc2)cc1": 430,
  "*c1ccc(C(=O)Nc2cccc(NC(=O)c3ccc(*)cc3)c2)cc1": 431,
  "*c1ccc(C(=O)OCCCCCCCCCCCCOC(=O)c2ccc(*)cc2)cc1": 432,
  "*c1ccc(C(=O)c2c(-c3ccccc3)ccc(-c3ccccc3)c2C(=O)c2ccc(*)cc2)cc1": 433,
  "*c1ccc(C(=O)c2c(C(=O)c3ccc(*)cc3)c(-c3ccc(F)cc3)c(-c3ccc(F)cc3)c(-c3ccc(F)cc3)c2-c2ccc(F)cc2)cc1": 434,
  "*c1ccc(C(=O)c2c(C(=O)c3ccc(*)cc3)c(-c3ccccc3)c(-c3ccc(F)cc3)c(-c3ccc(F)cc3)c2-c2ccccc2)cc1": 435,
  "*c1ccc(C(=O)c2c(C(=O)c3ccc(*)cc3)c(-c3ccccc3)c(-c3ccc4ccccc4c3)c(-c3ccc4ccccc4c3)c2-c2ccccc2)cc1": 436,
  "*c1ccc(C(=O)c2c(C(=O)c3ccc(*)cc3)c(-c3ccccc3)c(-c3ccccc3)c(-c3ccccc3)c2-c2ccccc2)cc1": 437,
  "*c1ccc(C(=O)c2c(C)ccc3c(C(=O)c4ccc(*)cc4)c(C)ccc23)cc1": 438,
  "*c1ccc(C(=O)c2c(OC)ccc3c(C(=O)c4ccc(*)cc4)c(OC)ccc23)cc1": 439,
  "*c1ccc(C(=O)c2c(OC)ccc3ccc(OC)c(C(=O)c4ccc(*)cc4)c23)cc1": 440,
  "*c1ccc(C(=O)c2c3ccccc3c(C(=O)c3ccc(*)cc3)c3ccccc23)cc1": 441,
  "*c1ccc(C(=O)c2cc(C#Cc3ccccc3)cc(C(=O)c3ccc(*)cc3)c2)cc1": 442,
  "*c1ccc(C(=O)c2cc(C(=O)c3ccc(*)cc3)cc(-c3ccc(-c4ccc(-c5ccccc5)cc4)cc3)c2)cc1": 443,
  "*c1ccc(C(=O)c2cc(C(=O)c3ccc(*)cc3)cc(-c3ccc(-c4ccccc4)cc3)c2)cc1": 444,
  "*c1ccc(C(=O)c2cc(C(=O)c3ccc(*)cc3)cc(-c3ccccc3)c2)cc1": 445,
  "*c1ccc(C(=O)c2cc(C(=O)c3ccc(*)cc3)cc(C(C)(C)C)c2)cc1": 446,
  "*c1ccc(C(=O)c2cc(C(=O)c3ccc(*)cc3)cc(N3C(=O)c4ccccc4C3=O)c2)cc1": 447,
  "*c1ccc(C(=O)c2cc3ccccc3cc2C(=O)c2ccc(*)cc2)cc1": 448,
  "*c1ccc(C(=O)c2ccc(*)c(S(=O)(=O)Oc3ccc(/N=N/c4ccc(C#N)cc4)cc3)c2)cc1S(=O)(=O)Oc1ccc(/N=N/c2ccc(C#N)cc2)cc1": 449,
  "*c1ccc(C(=O)c2ccc(*)c3ccccc23)c2ccccc12": 450,
  "*c1ccc(C(=O)c2ccc(*)c3ccccc23)cc1": 451,
  "*c1ccc(C(=O)c2ccc(*)cc2)cc1": 452,
  "*c1ccc(C(=O)c2ccc(*)nc2)cc1": 453,
  "*c1ccc(C(=O)c2ccc(-c3ccc(-c4ccc(C(=O)c5ccc(*)cc5)cc4)cc3)cc2)cc1": 454,
  "*c1ccc(C(=O)c2ccc(-c3ccc(C(=O)c4ccc(*)cc4)cc3)cc2)cc1": 455,
  "*c1ccc(C(=O)c2ccc(-c3cccc(C(=O)c4ccc(*)cc4)c3)cc2)cc1": 456,
  "*c1ccc(C(=O)c2ccc(C(=O)c3ccc(*)c(Cl)c3)cc2)cc1Cl": 457,
  "*c1ccc(C(=O)c2ccc(C(=O)c3ccc(*)c4ccccc34)cc2)c2ccccc12": 458,
  "*c1ccc(C(=O)c2ccc(C(=O)c3ccc(*)cc3)c(N)c2)cc1": 459,
  "*c1ccc(C(=O)c2ccc(C(=O)c3ccc(*)cc3)c3ccccc23)cc1": 460,
  "*c1ccc(C(=O)c2ccc(C(=O)c3ccc(*)cc3)cc2)cc1": 461,
  "*c1ccc(C(=O)c2ccc(C(=O)c3ccc(*)cc3)nc2)cc1": 462,
  "*c1ccc(C(=O)c2ccc(C(=O)c3ccc(*)cc3)o2)cc1": 463,
  "*c1ccc(C(=O)c2ccc(C(=O)c3ccc(*)cc3)s2)cc1": 464,
  "*c1ccc(C(=O)c2ccc(C(=O)c3ccc(C(=O)c4ccc(*)cc4)cc3)cc2)cc1": 465,
  "*c1ccc(C(=O)c2ccc(C)cc2C(=O)c2ccc(*)cc2)cc1": 466,
  "*c1ccc(C(=O)c2ccc(Cc3ccc(C(=O)c4ccc(*)cc4)cc3)cc2)cc1": 467,
  "*c1ccc(C(=O)c2ccc(Oc3ccc(-c4ccc(Oc5ccc(C(=O)c6ccc(*)cc6)cc5)cc4)cc3)cc2)cc1": 468,
  "*c1ccc(C(=O)c2ccc(Oc3ccc(C(=O)c4ccc(*)cc4)cc3)cc2)cc1": 469,
  "*c1ccc(C(=O)c2ccc(Oc3ccc(C(c4ccc(Oc5ccc(C(=O)c6ccc(*)cc6)c6ccccc56)cc4)(C(F)(F)F)C(F)(F)F)cc3)c3ccccc23)cc1": 470,
  "*c1ccc(C(=O)c2ccc(Oc3ccc(Nc4ccc(Nc5ccc(Nc6ccc(Nc7ccc(Oc8ccc(C(=O)c9ccc(*)cc9)cc8)cc7)cc6)cc5)cc4)cc3)cc2)cc1": 471,
  "*c1ccc(C(=O)c2ccc(Oc3ccc(Oc4ccc(C(=O)c5ccc(*)cc5)cc4C(C)C)cc3)c(C(C)C)c2)cc1": 472,
  "*c1ccc(C(=O)c2ccc(Oc3ccc(Oc4ccc(C(=O)c5ccc(*)cc5)cc4C)cc3)c(C)c2)cc1": 473,
  "*c1ccc(C(=O)c2ccc(Oc3ccc(S(=O)(=O)c4ccc(*)cc4)cc3)cc2)cc1": 474,
  "*c1ccc(C(=O)c2ccc(Oc3ccc(S(=O)(=O)c4ccc(Oc5ccc(C(=O)c6ccc(*)cc6)cc5)cc4)cc3)cc2)cc1": 475,
  "*c1ccc(C(=O)c2ccc(P(=O)(c3ccccc3)c3ccc(C(=O)c4ccc(*)cc4)cc3)cc2)cc1": 476,
  "*c1ccc(C(=O)c2ccc(Sc3ccc(C(=O)c4ccc(*)cc4)cc3)cc2)cc1": 477,
  "*c1ccc(C(=O)c2ccc3c(c2)C(=O)N(c2ccc(Cc4ccc(N5C(=O)c6ccc(C(=O)c7ccc(*)cc7)cc6C5=O)cc4)cc2)C3=O)cc1": 478,
  "*c1ccc(C(=O)c2ccc3c(c2)C(=O)N(c2ccc(N4C(=O)c5ccc(C(=O)c6ccc(*)cc6)cc5C4=O)cc2)C3=O)cc1": 479,
  "*c1ccc(C(=O)c2ccc3c(c2)C(=O)N(c2ccc(Oc4ccc(N5C(=O)c6ccc(C(=O)c7ccc(*)cc7)cc6C5=O)cc4)cc2)C3=O)cc1": 480,
  "*c1ccc(C(=O)c2ccc3c(c2)c2cc(C(=O)c4ccc(*)cc4)ccc2n3C)cc1": 481,
  "*c1ccc(C(=O)c2ccc3c(c2)c2cc(C(=O)c4ccc(*)cc4)ccc2n3CC)cc1": 482,
  "*c1ccc(C(=O)c2ccc3c(c2)c2cc(C(=O)c4ccc(*)cc4)ccc2n3CCCC)cc1": 483,
  "*c1ccc(C(=O)c2ccc3c(c2)c2cc(C(=O)c4ccc(*)cc4)ccc2n3CCCCCC)cc1": 484,
  "*c1ccc(C(=O)c2ccc3cc(C(=O)c4ccc(*)cc4)ccc3c2)cc1": 485,
  "*c1ccc(C(=O)c2ccc3ccccc3c2-c2c(C(=O)c3ccc(*)cc3)ccc3ccccc23)cc1": 486,
  "*c1ccc(C(=O)c2ccc3nc(C(=O)c4ccc(*)cc4)ccc3c2)cc1": 487,
  "*c1ccc(C(=O)c2ccc3oc4ccc(C(=O)c5ccc(*)cc5)cc4c3c2)cc1": 488,
  "*c1ccc(C(=O)c2cccc(-c3cccc(C(=O)c4ccc(*)cc4)c3)c2)cc1": 489,
  "*c1ccc(C(=O)c2cccc(C(=O)c3ccc(*)cc3)c2)cc1": 490,
  "*c1ccc(C(=O)c2cccc(C(=O)c3ccc(*)cc3)n2)cc1": 491,
  "*c1ccc(C(=O)c2cccc(S(=O)(=O)c3ccc(*)cc3)c2)cc1": 492,
  "*c1ccc(C(=O)c2cccc3cccc(C(=O)c4ccc(*)cc4)c23)cc1": 493,
  "*c1ccc(C(=O)c2ccccc2)c(-c2cc(*)ccc2C(=O)c2ccccc2)c1": 494,
  "*c1ccc(C(=O)c2ccccc2*)cc1": 495,
  "*c1ccc(C(=O)c2ccccc2-c2ccccc2C(=O)c2ccc(*)cc2)cc1": 496,
  "*c1ccc(C(=O)c2ccccc2C(=O)c2ccc(*)cc2)cc1": 497,
  "*c1ccc(C(=O)c2cnc3cc(C(=O)c4ccc(*)cc4)ccc3c2)cc1": 498,
  "*c1ccc(C(=O)c2ncc(C(=O)c3ccc(C(=O)c4cnc(C(=O)c5ccc(*)cc5)c5ccccc45)cc3)c3ccccc23)cc1": 499,
  "*c1ccc(C(C)=Nc2ccc(N=C(C)c3ccc(*)cc3)cc2)cc1": 500,
  "*c1ccc(C(C)=Nc2ccc(Oc3ccc(N=C(C)c4ccc(*)cc4)cc3)cc2)cc1": 501,
  "*c1ccc(C(F)(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)c2ccc(*)cc2)cc1": 502,
  "*c1ccc(C(c2ccc(*)cc2)(C(F)(F)F)C(F)(F)F)cc1": 503,
  "*c1ccc(C2(c3ccc(*)cc3)OC(=O)c3ccccc32)cc1": 504,
  "*c1ccc(C=CC(=O)c2ccc(*)c(C(F)(F)F)c2)cc1C(F)(F)F": 505,
  "*c1ccc(C=Nc2ccc(N=Cc3ccc(*)cc3)cc2)cc1": 506,
  "*c1ccc(C=Nc2ccc(Oc3ccc(N=Cc4ccc(*)cc4)cc3)cc2)cc1": 507,
  "*c1ccc(Nc2ccc(*)c(C(F)(F)F)c2)cc1C(F)(F)F": 508,
  "*c1ccc(P(=O)(c2ccc(*)cc2)c2cc(C(F)(F)F)cc(C(F)(F)F)c2)cc1": 509,
  "*c1ccc(P(=O)(c2ccc(*)cc2)c2ccc(-n3c4ccc(C(C)(C)C)cc4c4cc(C(C)(C)C)ccc43)cc2)cc1": 510,
  "*c1ccc(P(=O)(c2ccc(*)cc2)c2cccc(N)c2)cc1": 511,
  "*c1ccc(P(=O)(c2ccc(OC)cc2)c2ccc(*)c(C(F)(F)F)c2)cc1C(F)(F)F": 512,
  "*c1ccc(P(=O)(c2ccccc2)c2ccc(*)c(C(F)(F)F)c2)cc1C(F)(F)F": 513,
  "*c1ccc(P(=O)(c2ccccc2)c2ccc(*)cc2)cc1": 514,
  "*c1ccc(P(C)(=O)c2ccc(*)cc2)cc1": 515,
  "*c1ccc(S(=O)(=O)N(C)C)c(*)c1": 516,
  "*c1ccc(S(=O)(=O)N(CC=C)CCN(CC)CC)c(*)c1": 517,
  "*c1ccc(S(=O)(=O)N(CC=C)CCN(CC)CC)cc1*": 518,
  "*c1ccc(S(=O)(=O)c2ccc(*)c3ccccc23)c2ccccc12": 519,
  "*c1ccc(S(=O)(=O)c2ccc(*)c3ccccc23)cc1": 520,
  "*c1ccc(S(=O)(=O)c2ccc(*)cc2)cc1": 521,
  "*c1ccc(S(=O)(=O)c2ccc(*)cc2C(=O)c2ccccn2)c(C(=O)c2ccccn2)c1": 522,
  "*c1ccc(S(=O)(=O)c2ccc(*)cc2C(=O)c2ccncc2)c(C(=O)c2ccncc2)c1": 523,
  "*c1ccc(S(=O)(=O)c2ccc(*)cc2C(F)(F)F)c(C(F)(F)F)c1": 524,
  "*c1ccc(S(=O)(=O)c2ccc(-c3c(C)c4c(c(C)c3-c3ccc(S(=O)(=O)c5ccc(*)cc5)cc3)C(=O)N(c3ccccn3)C4=O)cc2)cc1": 525,
  "*c1ccc(S(=O)(=O)c2ccc(-c3ccc(S(=O)(=O)c4ccc(*)cc4)cc3)cc2)cc1": 526,
  "*c1ccc(S(=O)(=O)c2ccc(Oc3ccc(-c4ccc(Oc5ccc(S(=O)(=O)c6ccc(*)cc6)cc5)cc4)cc3)cc2)cc1": 527,
  "*c1ccc(S(=O)(=O)c2ccc(Oc3ccc(Oc4ccc(S(=O)(=O)c5ccc(*)cc5)cc4)cc3)cc2)cc1": 528,
  "*c1ccc(S(=O)(=O)c2ccc(Sc3ccccc3)c(S(=O)(=O)c3ccc(*)cc3)c2)cc1": 529,
  "*c1ccc(S(=O)(=O)c2ccc3c(c2)CCc2c4c(c5c(c2-3)-c2ccc(S(=O)(=O)c3ccc(*)cc3)cc2CC5)C(=O)N(c2ccccc2)C4=O)cc1": 530,
  "*c1ccc(S(=O)(=O)c2ccc3cc(S(=O)(=O)c4ccc(*)cc4)ccc3c2)cc1": 531,
  "*c1ccc(S(=O)(=O)c2ccc3oc4ccc(S(=O)(=O)c5ccc(*)cc5)cc4c3c2)cc1": 532,
  "*c1ccc(S(=O)(=O)c2cccc3c(S(=O)(=O)c4ccc(*)cc4)cccc23)cc1": 533,
  "*c1ccc(S(=O)c2ccc(*)cc2)cc1": 534,
  "*c1ccc(Sc2ccc(*)cc2)cc1": 535,
  "*c1ccc2c(c1)C(=O)N(c1ccc(N3C(=O)c4ccc(*)cc4C3=O)cc1)C2=O": 536,
  "*c1ccc2c(c1)C(=O)N(c1ccc(Oc3ccc(N4C(=O)c5ccc(*)cc5C4=O)cc3)cc1)C2=O": 537,
  "*c1ccc2c(c1)Sc1ccc(*)cc1S2": 538,
  "*c1cccc(*)c1-c1nc2ccccc2o1": 539,
  "*c1cccc(*)c1-c1nc2ccccc2s1": 540,
  "*c1cccc(*)c1C#N": 541,
  "*c1cccc(*)c1C(=O)Nc1ccc(Nc2ccc(Nc3ccc(Nc4ccccc4)cc3)cc2)cc1": 542,
  "*c1cccc(*)c1C(=O)Oc1ccc(N=Nc2ccc(C#N)c(C#N)c2)cc1": 543,
  "*c1cccc(*)c1C(=O)Oc1ccc(N=Nc2ccc(C#N)cc2)cc1": 544,
  "*c1cccc(*)c1C(=O)c1ccc(CCCOc2ccc(-n3c4ccccc4c4ccccc43)cc2)cc1": 545,
  "*c1cccc(*)c1C(=O)c1ccc(CCCOc2ccc(C(=C(c3ccccc3)c3ccccc3)c3ccccc3)cc2)cc1": 546,
  "*c1cccc(*)c1C(=O)c1ccc(OC(=C(C(F)(C(F)(F)F)C(F)(F)F)C(F)(C(F)(F)F)C(F)(F)F)C(F)(F)F)cc1": 547,
  "*c1cccc(*)c1C(=O)c1ccc(OCC=C)cc1": 548,
  "*c1cccc(*)c1C(=O)c1ccc(Oc2ccccc2)cc1": 549,
  "*c1cccc(*)c1S(=O)(=O)N(CC=C)CCN(CC)CC": 550,
  "*c1cccc(*)c1S(=O)(=O)Oc1ccc(N=Nc2ccc(N=Nc3ccc([N+](=O)[O-])cc3)cc2)cc1": 551,
  "*c1cccc(*)c1S(=O)(=O)Oc1ccc(N=Nc2ccc([N+](=O)[O-])cc2)cc1": 552,
  "*c1cccc(*)n1": 553,
  "*c1cccc(Oc2ccc(-c3ccc(Oc4cccc(*)c4C#N)cc3)cc2)c1C#N": 554,
  "*c1cccc(Oc2ccc(C3(c4ccc(Oc5cccc(*)c5C#N)cc4)c4ccccc4-c4ccccc43)cc2)c1C#N": 555,
  "*c1cccc(Oc2ccc(NC(=O)c3ccc(C(=O)Nc4ccc(Oc5cccc(*)c5C#N)cc4)cc3)cc2)c1C#N": 556,
  "*c1cccc(Oc2ccc(NC(=O)c3cccc(C(=O)Nc4ccc(Oc5cccc(*)c5C#N)cc4)c3)cc2)c1C#N": 557,
  "*c1cccc(Oc2ccc(Nc3ccc(Nc4ccc(Nc5ccc(Nc6ccc(Oc7cccc(*)c7C#N)cc6)cc5)cc4)cc3)cc2)c1C#N": 558,
  "*c1cccc(Oc2ccc(Oc3ccc(C(=O)c4cccc(C(=O)c5ccc(Oc6ccc(Oc7cccc(*)c7C#N)cc6)cc5)c4)cc3)cc2)c1C#N": 559,
  "*c1cccc(Oc2cccc(Oc3cccc(*)c3C#N)c2)c1C#N": 560,
  "*c1cccc2c1C(=O)c1cccc(*)c1C2=O": 561,
  "*c1ccnc(*)n1": 562,
  "*c1oc(-c2ccc(-c3nc(C(F)(F)F)c(*)o3)cc2)nc1C(F)(F)F": 563,
  "*c1sc(-c2ccc(-c3nc(C(F)(F)F)c(*)s3)cc2)nc1C(F)(F)F": 564,
  "*c1sc(-c2cccc(-c3nc(C(F)(F)F)c(*)s3)c2)nc1C(F)(F)F": 565,
  "*n1c(-c2ccc(-c3nc4ccccc4n3*)cc2)nc2ccccc21": 566,
  "*n1c(-c2ccc(C(=O)c3ccc(-c4nc5cc(C)ccc5n4*)cc3)cc2)nc2cc(C)ccc21": 567,
  "*n1c(-c2ccc(C(=O)c3ccc(-c4nc5ccccc5n4*)cc3)cc2)nc2ccccc21": 568,
  "*n1c(-c2ccc(Oc3ccc(-c4nc5cc(C)ccc5n4*)cc3)cc2)nc2cc(C)ccc21": 569,
  "*n1c(-c2ccc(Oc3ccc(-c4nc5ccccc5n4*)cc3)cc2)nc2ccccc21": 570,
  "*n1c(-c2ccc(S(=O)(=O)c3ccc(-c4nc5cc(C)ccc5n4*)cc3)cc2)nc2cc(C)ccc21": 571,
  "*n1c(-c2ccc(S(=O)(=O)c3ccc(-c4nc5ccccc5n4*)cc3)cc2)nc2ccccc21": 572,
  "*n1c(-c2cccc(-c3nc4ccccc4n3*)n2)nc2ccccc21": 573,
  "*n1c(=O)n(*)c2cc(C)c(C)cc21": 574,
  "*n1c(=O)n(*)c2ccccc21": 575,
  "*n1cnc2cc(-c3ccc4ncn(*)c4c3)ccc21": 576,
  "*n1nc(-c2ccc(-c3ccc(-c4ccc(-c5nn(*)c(=O)c6ccccc56)cc4)s3)cc2)c2ccccc2c1=O": 577,
  "*n1nc(-c2ccc(Cc3ccc(-c4nn(*)c(=O)c5ccccc45)cc3)cc2)c2ccccc2c1=O": 578,
  "*n1nc(-c2ccc(Oc3ccc(-c4ccc(Oc5ccc(-c6nn(*)c(=O)c7ccccc67)cc5)cc4)cc3)cc2)c2ccccc2c1=O": 579,
  "*n1nc(-c2ccc(Oc3ccc(-c4nn(*)c(=O)c5ccccc45)cc3)cc2)c2ccccc2c1=O": 580,
  "*n1nc(-c2ccc(Oc3ccc(C(C)(C)c4ccc(Oc5ccc(-c6nn(*)c(=O)c7ccccc67)cc5)cc4)cc3)cc2)c2ccccc2c1=O": 581,
  "*n1nc(-c2ccc(Oc3ccc(C(c4ccc(Oc5ccc(-c6nn(*)c(=O)c7ccccc67)cc5)cc4)(C(F)(F)F)C(F)(F)F)cc3)cc2)c2ccccc2c1=O": 582,
  "*n1nc(-c2ccc(Oc3ccc(Oc4ccc(Oc5ccc(-c6nn(*)c(=O)c7ccccc67)cc5)cc4)cc3)cc2)c2ccccc2c1=O": 583,
  "*n1nc(-c2ccc(Oc3cccc(Oc4ccc(-c5nn(*)c(=O)c6ccccc56)cc4)c3C#N)cc2)c2ccccc2c1=O": 584,
  "*n1nc(-c2ccc(Sc3ccc(Oc4ccc(Sc5ccc(-c6nn(*)c(=O)c7ccccc67)cc5)cc4)cc3)cc2)c2ccccc2c1=O": 585,
  "*n1nc(-c2ccccc2)c2cc(-c3ccc4c(-c5ccccc5)nn(*)c(=O)c4c3)ccc2c1=O": 586,
  "*n1nc(-c2ccccc2)c2cc(Oc3ccc(C(C)(C)c4ccc(Oc5ccc6c(-c7ccccc7)nn(*)c(=O)c6c5)cc4)cc3)ccc2c1=O": 587,
  "*n1nc(-c2ccccc2)c2cc(Oc3ccc4c(-c5ccccc5)nn(*)c(=O)c4c3)ccc2c1=O": 588
}